camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
#ifndef IOATA5700_H_OVERALL
#define IOATA5700_H_OVERALL
/****** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ******************** */
/****** Created: 2015-11-19 09:05 ******* Source: ATA5702M322_internal.xml  */
/**************************************************************************
 *
 * - File Name          : "ioATA5702M322_internal.h"
 * - Title              : Register/Bit Definitions for the ATA5702M322
 * - Date               : 2015-11-19
 * - Version            : 2.25
 * - Support E-Mail     : avr@atmel.com
 * - Target MCU         : ATA5702M322
 * - Version 			: V2.2
 *
 * - Compiler           : IAR Embedded Workbench - iccAVR and aAVR.
 *
 **************************************************************************
 */


#include "iomacro.h"

#if TID_GUARD(3)
#error This file should only be compiled with iccavr or aavr whith processor option -v3
#endif /* TID_GUARD(3) */

/* Include the SFR part if this file has not been included before,
* OR this file is included by the assembler (SFRs must be defined in
* each assembler module). */
#if !defined(__IOATA5702M322_INTERNAL_H) || defined(__IAR_SYSTEMS_ASM__)

#pragma language=extended

/*==========================*/
/* Predefined SFR Addresses */
/*==========================*/


/* ***** SPECIFY DEVICE *************************************************** */
/*#define  PART_NAME       ATA5702M322 */
#define    SIGNATURE_000   0x1e
#define    SIGNATURE_001   0x95
#define    SIGNATURE_002   0x69



/* ***** I/O REGISTER DEFINITIONS ***************************************** */
/* NOTE:
 * Definitions marked "MEMORY MAPPED"are extended I/O ports
 * and cannot be used with IN/OUT instructions
 */
SFR_B(GPIOR0,	0x00)
SFR_B(PRR1,	0x01)
SFR_B(PRR2,	0x02)
SFR_B(PINB,	0x03)
SFR_B(DDRB,	0x04)
SFR_B(PORTB,	0x05)
SFR_B(PINC,	0x06)
SFR_B(DDRC,	0x07)
SFR_B(PORTC,	0x08)
SFR_B(PIND,	0x09)
SFR_B(DDRD,	0x0a)
SFR_B(PORTD,	0x0b)
SFR_B(TPCR2,	0x0c)
SFR_B(TPFR,	0x0d)
SFR_B(MCUCR,	0x0e)
SFR_B(FSCR,	0x0f)
SFR_B(T1CR,	0x11)
SFR_B(T2CR,	0x12)
SFR_B(T3CR,	0x13)
SFR_B(T4CR,	0x14)
SFR_B(LTCMR,	0x15)
SFR_B(EECR2,	0x16)
SFR_B(PHTCR,	0x17)
SFR_B(LDFFL,	0x18)
SFR_B(LDFD,	0x19)
SFR_B(PRR0,	0x1a)
SFR_B(PHFR,	0x1b)
SFR_B(LFFR,	0x1c)
SFR_B(AESCR,	0x1d)
SFR_B(AESSR,	0x1e)
SFR_B(EECR,	0x1f)
SFR_B(EEDR,	0x20)
SFR_B(EEARL,	0x21)
SFR_B(EEARH,	0x22)
SFR_B(EEPR0,	0x23)
SFR_B(GPIOR1,	0x24)
SFR_B(GPIOR2,	0x25)
SFR_B(PCICR,	0x26)
SFR_B(EIMSK,	0x27)
SFR_B(EIFR,	0x28)
SFR_B(LDFCKSW,	0x29)
SFR_B(VMSCR,	0x2a)
SFR_B(MCUSR,	0x2b)
SFR_B(SPCR,	0x2c)
SFR_B(SPSR,	0x2d)
SFR_B(SPDR,	0x2e)
SFR_B(LFCR0,	0x2f)
SFR_B(LFCR1,	0x30)
SFR_B(DWDR,	0x31)
SFR_B(T0IFR,	0x32)
SFR_B(SPMCSR,	0x37)
SFR_B(SMCR,	0x38)
SFR_B(TPSR,	0x39)
SFR_B(LFCR2,	0x3a)
SFR_B(LFCR3,	0x3b)
SFR_B(SPL,	0x3d)
SFR_B(SPH,	0x3e)
SFR_B(SREG,	0x3f)
SFR_B(FSEN,	0x60)
SFR_B(FSFCR,	0x61)
SFR_B(GACDIVL,	0x62)
SFR_B(GACDIVH,	0x63)
SFR_B(FFREQ1L,	0x64)
SFR_B(FFREQ1M,	0x65)
SFR_B(FFREQ1H,	0x66)
SFR_B(FFREQ2L,	0x67)
SFR_B(FFREQ2M,	0x68)
SFR_B(FFREQ2H,	0x69)
SFR_B(BBTE2,	0x6a)
SFR_B(EICRA,	0x6b)
SFR_B(PCMSK0,	0x6c)
SFR_B(PCMSK1,	0x6d)
SFR_B(WDTCR,	0x6e)
SFR_B(T1CNT,	0x6f)
SFR_B(T1COR,	0x70)
SFR_B(T1MR,	0x71)
SFR_B(T1IMR,	0x72)
SFR_B(T2CNT,	0x73)
SFR_B(T2COR,	0x74)
SFR_B(T2MR,	0x75)
SFR_B(T2IMR,	0x76)
SFR_B(T3CNTL,	0x77)
SFR_B(T3CNTH,	0x78)
SFR_B(T3CORL,	0x79)
SFR_B(T3CORH,	0x7a)
SFR_B(T3ICRL,	0x7b)
SFR_B(T3ICRH,	0x7c)
SFR_B(T3MRA,	0x7d)
SFR_B(T3MRB,	0x7e)
SFR_B(T3IMR,	0x7f)
SFR_B(T4CNTL,	0x80)
SFR_B(T4CNTH,	0x81)
SFR_B(T4CORL,	0x82)
SFR_B(T4CORH,	0x83)
SFR_B(T4ICRL,	0x84)
SFR_B(T4ICRH,	0x85)
SFR_B(T4MRA,	0x86)
SFR_B(T4MRB,	0x87)
SFR_B(T4IMR,	0x88)
SFR_B(T5TEMP,	0x89)
SFR_B(T5OCRL,	0x8a)
SFR_B(T5OCRH,	0x8b)
SFR_B(T5CCR,	0x8c)
SFR_B(T5CNTL,	0x8d)
SFR_B(T5CNTH,	0x8e)
SFR_B(T5IMR,	0x8f)
SFR_B(LFCALR1,	0x90)
SFR_B(LFCALR2,	0x91)
SFR_B(LFCALR3,	0x92)
SFR_B(LFCALR4,	0x93)
SFR_B(LFCALR5,	0x94)
SFR_B(LFCALR6,	0x95)
SFR_B(LFCALR7,	0x96)
SFR_B(LFCALR8,	0x97)
SFR_B(LFCALR9,	0x98)
SFR_B(LFCALR10,	0x99)
SFR_B(LFCALR11,	0x9a)
SFR_B(LFCALR12,	0x9b)
SFR_B(LFCALR13,	0x9c)
SFR_B(LFCALR14,	0x9d)
SFR_B(LFCALR15,	0x9e)
SFR_B(LFCALR16,	0x9f)
SFR_B(LFCALR17,	0xa0)
SFR_B(LFCALR18,	0xa1)
SFR_B(LFCALR19,	0xa2)
SFR_B(LFCALR20,	0xa3)
SFR_B(LFCALR21,	0xa4)
SFR_B(LFCALR22,	0xa5)
SFR_B(LFCALR23,	0xa6)
SFR_B(LFCALR24,	0xa7)
SFR_B(LFCALR25,	0xa8)
SFR_B(LFCALR26,	0xa9)
SFR_B(LFCALR27,	0xaa)
SFR_B(LFCALR28,	0xab)
SFR_B(LFCALR29,	0xac)
SFR_B(LFCALR30,	0xad)
SFR_B(LFCALR31,	0xae)
SFR_B(LFCALR32,	0xaf)
SFR_B(LFCALR33,	0xb0)
SFR_B(LFCALR34,	0xb1)
SFR_B(LFCALR35,	0xb2)
SFR_B(LFCALR36,	0xb3)
SFR_B(LFCALR37,	0xb4)
SFR_B(LFCALR38,	0xb5)
SFR_B(LFCALR39,	0xb6)
SFR_B(LFCALR40,	0xb7)
SFR_B(LFCALR41,	0xb8)
SFR_B(LFCALR42,	0xb9)
SFR_B(LFCALR43,	0xba)
SFR_B(LFCALR44,	0xbb)
SFR_B(LFCALR45,	0xbc)
SFR_B(LFCALR46,	0xbd)
SFR_B(LFCALR47,	0xbe)
SFR_B(LFCALR48,	0xbf)
SFR_B(LFCALR49,	0xc0)
SFR_B(LFCALR50,	0xc1)
SFR_B(LFCALR51,	0xc2)
SFR_B(LFCALR52,	0xc3)
SFR_B(LFCALR53,	0xc4)
SFR_B(XFUSE,	0xc5)
SFR_B(MRCCAL,	0xc6)
SFR_B(FRCCAL,	0xc7)
SFR_B(RCTCAL,	0xc8)
SFR_B(CMSR,	0xc9)
SFR_B(CMOCR,	0xca)
SFR_B(SUPFR,	0xcb)
SFR_B(SUPCR,	0xcc)
SFR_B(SUPCA1,	0xcd)
SFR_B(SUPCA2,	0xce)
SFR_B(SUPCA3,	0xcf)
SFR_B(SUPCA4,	0xd0)
SFR_B(CALRDY,	0xd1)
SFR_B(DFS,	0xd2)
SFR_B(DFL,	0xd5)
SFR_B(DFWP,	0xd6)
SFR_B(DFRP,	0xd7)
SFR_B(DFD,	0xd8)
SFR_B(DFI,	0xd9)
SFR_B(DFC,	0xda)
SFR_B(SFS,	0xdb)
SFR_B(SFL,	0xdc)
SFR_B(SFWP,	0xdd)
SFR_B(SFRP,	0xde)
SFR_B(SFD,	0xdf)
SFR_B(SFI,	0xe0)
SFR_B(SFC,	0xe1)
SFR_B(SSMCR,	0xe2)
SFR_B(GTCCR,	0xe3)
SFR_B(SSMFBR,	0xe4)
SFR_B(SSMRR,	0xe5)
SFR_B(SSMSR,	0xe6)
SFR_B(SSMIFR,	0xe7)
SFR_B(SSMIMR,	0xe8)
SFR_B(MSMSTR,	0xe9)
SFR_B(SSMSTR,	0xea)
SFR_B(VXMCTRL,	0xeb)
SFR_B(MSMCR1,	0xec)
SFR_B(MSMCR2,	0xed)
SFR_B(MSMCR3,	0xee)
SFR_B(MSMCR4,	0xef)
SFR_B(SP2CR,	0xf7)
SFR_B(SP2DR,	0xf8)
SFR_B(SP2SR,	0xf9)
SFR_B(TRCIDL,	0xfc)
SFR_B(TRCIDH,	0xfd)
SFR_B(TRCDR,	0xff)
SFR_B_EXT_IO_R(0x100,	FESR)
SFR_B_EXT_IO_R(0x101,	FEEN1)
SFR_B_EXT_IO_R(0x102,	FEEN2)
SFR_B_EXT_IO_R(0x103,	FELNA)
SFR_B_EXT_IO_R(0x104,	FEAT)
SFR_B_EXT_IO_R(0x105,	FEPAC)
SFR_B_EXT_IO_R(0x106,	FEVCT)
SFR_B_EXT_IO_R(0x107,	FEBT)
SFR_B_EXT_IO_R(0x108,	FEMS)
SFR_B_EXT_IO_R(0x109,	FETN4)
SFR_B_EXT_IO_R(0x10a,	FECR)
SFR_B_EXT_IO_R(0x10b,	FEVCO)
SFR_B_EXT_IO_R(0x10c,	FEALR)
SFR_B_EXT_IO_R(0x10d,	FEANT)
SFR_B_EXT_IO_R(0x10e,	FEBIA)
SFR_B_EXT_IO_R(0x10f,	SPARE1)
SFR_B_EXT_IO_R(0x110,	SPARE2)
SFR_B_EXT_IO_R(0x111,	SPARE3)
SFR_B_EXT_IO_R(0x112,	SPARE4)
SFR_B_EXT_IO_R(0x115,	CLKOD)
SFR_B_EXT_IO_R(0x116,	CLKOCR)
SFR_B_EXT_IO_R(0x11c,	FETE1)
SFR_B_EXT_IO_R(0x11d,	FETE2)
SFR_B_EXT_IO_R(0x11e,	FETE3)
SFR_B_EXT_IO_R(0x11f,	FETD)
SFR_B_EXT_IO_R(0x120,	TMFSM)
SFR_B_EXT_IO_R(0x121,	TMCRCL)
SFR_B_EXT_IO_R(0x122,	TMCRCH)
SFR_B_EXT_IO_R(0x123,	TMCSB)
SFR_B_EXT_IO_R(0x124,	TMCIL)
SFR_B_EXT_IO_R(0x125,	TMCIH)
SFR_B_EXT_IO_R(0x126,	TMCPL)
SFR_B_EXT_IO_R(0x127,	TMCPH)
SFR_B_EXT_IO_R(0x128,	TMSHR)
SFR_B_EXT_IO_R(0x129,	TMTLL)
SFR_B_EXT_IO_R(0x12a,	TMTLH)
SFR_B_EXT_IO_R(0x12b,	TMSSC)
SFR_B_EXT_IO_R(0x12c,	TMSR)
SFR_B_EXT_IO_R(0x12d,	TMCR2)
SFR_B_EXT_IO_R(0x12e,	TMCR1)
SFR_B_EXT_IO_R(0x130,	LFDSR1)
SFR_B_EXT_IO_R(0x131,	LFDSR2)
SFR_B_EXT_IO_R(0x132,	LFDSR3)
SFR_B_EXT_IO_R(0x133,	LFDSR4)
SFR_B_EXT_IO_R(0x134,	LFDSR5)
SFR_B_EXT_IO_R(0x135,	LFDSR6)
SFR_B_EXT_IO_R(0x136,	LFDSR7)
SFR_B_EXT_IO_R(0x137,	LFDSR8)
SFR_B_EXT_IO_R(0x138,	LFDSR9)
SFR_B_EXT_IO_R(0x139,	LFDSR10)
SFR_B_EXT_IO_R(0x13a,	LFDSR11)
SFR_B_EXT_IO_R(0x13b,	EEPR1)
SFR_B_EXT_IO_R(0x13c,	EEPR2)
SFR_B_EXT_IO_R(0x13d,	EEPR3)
SFR_B_EXT_IO_R(0x145,	CRCCR)
SFR_B_EXT_IO_R(0x146,	CRCDOR)
SFR_B_EXT_IO_R(0x151,	LFSRCTM)
SFR_B_EXT_IO_R(0x152,	DBCR)
SFR_B_EXT_IO_R(0x153,	DBTC)
SFR_B_EXT_IO_R(0x154,	DBENB)
SFR_B_EXT_IO_R(0x155,	DBENC)
SFR_B_EXT_IO_R(0x156,	DBGSW)
SFR_B_EXT_IO_R(0x157,	SFFR)
SFR_B_EXT_IO_R(0x158,	SFIR)
SFR_B_EXT_IO_R(0x159,	T2IFR)
SFR_B_EXT_IO_R(0x15a,	PGMST)
SFR_B_EXT_IO_R(0x15b,	EEST)
SFR_B_EXT_IO_R(0x15c,	LFSRCTL)
SFR_B_EXT_IO_R(0x161,	PCIFR)
SFR_B_EXT_IO_R(0x162,	T0CR)
SFR_B_EXT_IO_R(0x164,	DBEND)
SFR_B_EXT_IO_R(0x165,	TPCR1)
SFR_B_EXT_IO_R(0x166,	TPIMR)
SFR_B_EXT_IO_R(0x167,	TPDCR1)
SFR_B_EXT_IO_R(0x168,	TPDCR2)
SFR_B_EXT_IO_R(0x169,	TPDCR3)
SFR_B_EXT_IO_R(0x16a,	TPDCR4)
SFR_B_EXT_IO_R(0x16b,	TPDCR5)
SFR_B_EXT_IO_R(0x16c,	TPECR1)
SFR_B_EXT_IO_R(0x16d,	TPECR2)
SFR_B_EXT_IO_R(0x16e,	TPECR3)
SFR_B_EXT_IO_R(0x16f,	TPECR4)
SFR_B_EXT_IO_R(0x170,	TPECMR)
SFR_B_EXT_IO_R(0x171,	TPCR3)
SFR_B_EXT_IO_R(0x172,	TPCR4)
SFR_B_EXT_IO_R(0x173,	TPCR5)
SFR_B_EXT_IO_R(0x175,	TPCALR1)
SFR_B_EXT_IO_R(0x176,	TPCALR2)
SFR_B_EXT_IO_R(0x177,	TPCALR3)
SFR_B_EXT_IO_R(0x178,	TPCALR4)
SFR_B_EXT_IO_R(0x179,	TPCALR5)
SFR_B_EXT_IO_R(0x17a,	TPCALR6)
SFR_B_EXT_IO_R(0x17b,	TPCALR7)
SFR_B_EXT_IO_R(0x17c,	TPCALR8)
SFR_B_EXT_IO_R(0x17d,	TPCALR9)
SFR_B_EXT_IO_R(0x17e,	TPCALR10)
SFR_B_EXT_IO_R(0x17f,	AESDPR)
SFR_B_EXT_IO_R(0x180,	AESKR)
SFR_B_EXT_IO_R(0x181,	AESDR)
SFR_B_EXT_IO_R(0x182,	GPIOR3)
SFR_B_EXT_IO_R(0x183,	GPIOR4)
SFR_B_EXT_IO_R(0x184,	GPIOR5)
SFR_B_EXT_IO_R(0x185,	GPIOR6)
SFR_B_EXT_IO_R(0x186,	GPIOR7)
SFR_B_EXT_IO_R(0x187,	GPIOR8)
SFR_B_EXT_IO_R(0x188,	PHBCRR)
SFR_B_EXT_IO_R(0x18e,	LFCPR)
SFR_B_EXT_IO_R(0x18f,	LFIMR)
SFR_B_EXT_IO_R(0x190,	PHID00)
SFR_B_EXT_IO_R(0x191,	PHID01)
SFR_B_EXT_IO_R(0x192,	PHID02)
SFR_B_EXT_IO_R(0x193,	PHID03)
SFR_B_EXT_IO_R(0x194,	PHID0L)
SFR_B_EXT_IO_R(0x195,	PHID10)
SFR_B_EXT_IO_R(0x196,	PHID11)
SFR_B_EXT_IO_R(0x197,	PHID12)
SFR_B_EXT_IO_R(0x198,	PHID13)
SFR_B_EXT_IO_R(0x199,	PHID1L)
SFR_B_EXT_IO_R(0x19a,	PHIDFR)
SFR_B_EXT_IO_R(0x19b,	LFSYSY0)
SFR_B_EXT_IO_R(0x19c,	LFSYSY1)
SFR_B_EXT_IO_R(0x19d,	LFSYSY2)
SFR_B_EXT_IO_R(0x19e,	LFSYSY3)
SFR_B_EXT_IO_R(0x19f,	LFSYLE)
SFR_B_EXT_IO_R(0x1a0,	LFSTOP)
SFR_B_EXT_IO_R(0x1a1,	LTCOR)
SFR_B_EXT_IO_R(0x1a2,	T1IFR)
SFR_B_EXT_IO_R(0x1a4,	PHTBLR)
SFR_B_EXT_IO_R(0x1a5,	PHDFR)
SFR_B_EXT_IO_R(0x1a6,	LTEMR)
SFR_B_EXT_IO_R(0x1a7,	LFQC3)
SFR_B_EXT_IO_R(0x1a8,	LFQC2)
SFR_B_EXT_IO_R(0x1a9,	LFQC1)
SFR_B_EXT_IO_R(0x1aa,	TW2BR)
SFR_B_EXT_IO_R(0x1ab,	TW2CR)
SFR_B_EXT_IO_R(0x1ac,	TW2SR)
SFR_B_EXT_IO_R(0x1ad,	TW2DR)
SFR_B_EXT_IO_R(0x1ae,	TW2AR)
SFR_B_EXT_IO_R(0x1af,	TW2AMR)
SFR_B_EXT_IO_R(0x1b0,	RSCR)
SFR_B_EXT_IO_R(0x1b1,	RSSR)
SFR_B_EXT_IO_R(0x1b2,	RSMS1R)
SFR_B_EXT_IO_R(0x1b3,	RSMS2R)
SFR_B_EXT_IO_R(0x1b4,	RSFR)
SFR_B_EXT_IO_R(0x1b6,	RSCALIB)
SFR_B_EXT_IO_R(0x1b7,	RSDLYR)
SFR_B_EXT_IO_R(0x1b8,	RSRES1L)
SFR_B_EXT_IO_R(0x1b9,	RSRES1H)
SFR_B_EXT_IO_R(0x1ba,	RSRES2L)
SFR_B_EXT_IO_R(0x1bb,	RSRES2H)
SFR_B_EXT_IO_R(0x1bc,	RSRES3L)
SFR_B_EXT_IO_R(0x1bd,	RSRES3H)
SFR_B_EXT_IO_R(0x1be,	RSRES4L)
SFR_B_EXT_IO_R(0x1bf,	RSRES4H)
SFR_B_EXT_IO_R(0x1c0,	RSSRCR)
SFR_B_EXT_IO_R(0x1c1,	SD12RR)
SFR_B_EXT_IO_R(0x1c2,	SD13RR)
SFR_B_EXT_IO_R(0x1c3,	SD23RR)
SFR_B_EXT_IO_R(0x1c4,	SD360R)
SFR_B_EXT_IO_R(0x1c5,	RSDBGR)
SFR_B_EXT_IO_R(0x1d1,	LDFS)
SFR_B_EXT_IO_R(0x1d2,	T4IFR)
SFR_B_EXT_IO_R(0x1d3,	LDFWP)
SFR_B_EXT_IO_R(0x1d4,	LDFRP)
SFR_B_EXT_IO_R(0x1d5,	T5IFR)
SFR_B_EXT_IO_R(0x1d6,	LDFIM)
SFR_B_EXT_IO_R(0x1d7,	LDFC)
SFR_B_EXT_IO_R(0x1d8,	PHIMR)
SFR_B_EXT_IO_R(0x1d9,	PHCRCR)
SFR_B_EXT_IO_R(0x1da,	PHCSTL)
SFR_B_EXT_IO_R(0x1db,	PHCSTH)
SFR_B_EXT_IO_R(0x1dc,	PHCRPL)
SFR_B_EXT_IO_R(0x1dd,	PHCRPH)
SFR_B_EXT_IO_R(0x1de,	PHCSRL)
SFR_B_EXT_IO_R(0x1df,	PHCSRH)
SFR_B_EXT_IO_R(0x1e0,	CRCDIR)
SFR_B_EXT_IO_R(0x1e1,	T3IFR)
SFR_B_EXT_IO_R(0x1e3,	CMCR)
SFR_B_EXT_IO_R(0x1e4,	CMIMR)
SFR_B_EXT_IO_R(0x1e5,	CLPR)
SFR_B_EXT_IO_R(0x1e6,	VMCR)
SFR_B_EXT_IO_R(0x1e7,	DBONDR)
SFR_B_EXT_IO_R(0x1e8,	CALRDYLF)
SFR_B_EXT_IO_R(0x1e9,	TW1BR)
SFR_B_EXT_IO_R(0x1ea,	TW1CR)
SFR_B_EXT_IO_R(0x1eb,	TW1SR)
SFR_B_EXT_IO_R(0x1ec,	TW1DR)
SFR_B_EXT_IO_R(0x1ed,	TW1AR)
SFR_B_EXT_IO_R(0x1ee,	TW1AMR)
SFR_B_EXT_IO_R(0x1ef,	PDSCR)
SFR_B_EXT_IO_R(0x1f0,	TMOCR)
SFR_B_EXT_IO_R(0x1f1,	SRCCAL)
SFR_B_EXT_IO_R(0x1f2,	SRCTCAL)
SFR_B_EXT_IO_R(0x1f3,	SUPCA5)
SFR_B_EXT_IO_R(0x1f4,	SUPCA6)
SFR_B_EXT_IO_R(0x1f5,	SUPCA7)
SFR_B_EXT_IO_R(0x1f6,	SUPCA8)
SFR_B_EXT_IO_R(0x1f7,	SUPCA9)
SFR_B_EXT_IO_R(0x1f8,	SUPCA10)
SFR_B_EXT_IO_R(0x1f9,	TPCALR11)
SFR_B_EXT_IO_R(0x1fa,	TPCALR12)
SFR_B_EXT_IO_R(0x1fb,	TPCALR13)
SFR_B_EXT_IO_R(0x1fe,	PMTER)
SFR_B_EXT_IO_R(0x1ff,	SRCCALL)



#ifndef __IOATA5702M322_INTERNAL_H
#define __IOATA5702M322_INTERNAL_H

