camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
#ifdef __IAR_SYSTEMS_ASM__ 
#ifndef ENABLE_BIT_DEFINITIONS
#define  ENABLE_BIT_DEFINITIONS
#endif /* ENABLE_BIT_DEFINITIONS */
#endif /* __IAR_SYSTEMS_ASM__ */

#ifdef ENABLE_BIT_DEFINITIONS
/* ***** BIT DEFINITIONS ************************************************** */

/* ***** AES ************************** */
/* AESCR - AES Control Register */
#define    AESWK           0       /* AES Write Key */
#define    BM_AESWK	(uint8_t)(1U<<AESWK)
#define    AESWD           1       /* AES Write Data */
#define    BM_AESWD	(uint8_t)(1U<<AESWD)
#define    AESIM           2       /* AES Interrupt Mask */
#define    BM_AESIM	(uint8_t)(1U<<AESIM)
#define    AESD            3       /* AES Direction */
#define    BM_AESD	(uint8_t)(1U<<AESD)
#define    AESXOR          4       /* AES State XOR load */
#define    BM_AESXOR	(uint8_t)(1U<<AESXOR)
#define    AESRES          5       /* AES Reset */
#define    BM_AESRES	(uint8_t)(1U<<AESRES)
#define    AESLKM          6       /* AES Load Key Memory */
#define    BM_AESLKM	(uint8_t)(1U<<AESLKM)
#define    AESE            7       /* AES Enable */
#define    BM_AESE	(uint8_t)(1U<<AESE)

/* AESDPR - AES Data Pointer Register */
#define    AESDPR0         0       /* AES Data Pointer Register bit 0 */
#define    BM_AESDPR0	(uint8_t)(1U<<AESDPR0)
#define    AESDPR1         1       /* AES Data Pointer Register bit 1 */
#define    BM_AESDPR1	(uint8_t)(1U<<AESDPR1)
#define    AESDPR2         2       /* AES Data Pointer Register bit 2 */
#define    BM_AESDPR2	(uint8_t)(1U<<AESDPR2)
#define    AESDPR3         3       /* AES Data Pointer Register bit 3 */
#define    BM_AESDPR3	(uint8_t)(1U<<AESDPR3)

/* AESDR - AES Data Register */
#define    AESDR0          0       /* AES Data Register bit 0 */
#define    BM_AESDR0	(uint8_t)(1U<<AESDR0)
#define    AESDR1          1       /* AES Data Register bit 1 */
#define    BM_AESDR1	(uint8_t)(1U<<AESDR1)
#define    AESDR2          2       /* AES Data Register bit 2 */
#define    BM_AESDR2	(uint8_t)(1U<<AESDR2)
#define    AESDR3          3       /* AES Data Register bit 3 */
#define    BM_AESDR3	(uint8_t)(1U<<AESDR3)
#define    AESDR4          4       /* AES Data Register bit 4 */
#define    BM_AESDR4	(uint8_t)(1U<<AESDR4)
#define    AESDR5          5       /* AES Data Register bit 5 */
#define    BM_AESDR5	(uint8_t)(1U<<AESDR5)
#define    AESDR6          6       /* AES Data Register bit 6 */
#define    BM_AESDR6	(uint8_t)(1U<<AESDR6)
#define    AESDR7          7       /* AES Data Register bit 7 */
#define    BM_AESDR7	(uint8_t)(1U<<AESDR7)

/* AESKR - AES Key Register */
#define    AESKR0          0       /* AES Key Register bit 0 */
#define    BM_AESKR0	(uint8_t)(1U<<AESKR0)
#define    AESKR1          1       /* AES Key Register bit 1 */
#define    BM_AESKR1	(uint8_t)(1U<<AESKR1)
#define    AESKR2          2       /* AES Key Register bit 2 */
#define    BM_AESKR2	(uint8_t)(1U<<AESKR2)
#define    AESKR3          3       /* AES Key Register bit 3 */
#define    BM_AESKR3	(uint8_t)(1U<<AESKR3)
#define    AESKR4          4       /* AES Key Register bit 4 */
#define    BM_AESKR4	(uint8_t)(1U<<AESKR4)
#define    AESKR5          5       /* AES Key Register bit 5 */
#define    BM_AESKR5	(uint8_t)(1U<<AESKR5)
#define    AESKR6          6       /* AES Key Register bit 6 */
#define    BM_AESKR6	(uint8_t)(1U<<AESKR6)
#define    AESKR7          7       /* AES Key Register bit 7 */
#define    BM_AESKR7	(uint8_t)(1U<<AESKR7)

/* AESSR - AES Status Register */
#define    AESRF           0       /* AES Ready Flag */
#define    BM_AESRF	(uint8_t)(1U<<AESRF)
#define    AESERF          7       /* AES Error Flag */
#define    BM_AESERF	(uint8_t)(1U<<AESERF)


/* ***** CLK ************************** */
/* CLKOCR - Clock output control Register */
#define    CLKOS0          0       /* Clock output source bit 0 */
#define    BM_CLKOS0	(uint8_t)(1U<<CLKOS0)
#define    CLKOS1          1       /* Clock output source bit 1 */
#define    BM_CLKOS1	(uint8_t)(1U<<CLKOS1)
#define    CLKOEN          2       /* Clock output driver enable */
#define    BM_CLKOEN	(uint8_t)(1U<<CLKOEN)

/* CLKOD - Clock output divider settings Register */
#define    CLKOD0          0       /* Clock output divider bit 0 */
#define    BM_CLKOD0	(uint8_t)(1U<<CLKOD0)
#define    CLKOD1          1       /* Clock output divider bit 1 */
#define    BM_CLKOD1	(uint8_t)(1U<<CLKOD1)
#define    CLKOD2          2       /* Clock output divider bit 2 */
#define    BM_CLKOD2	(uint8_t)(1U<<CLKOD2)
#define    CLKOD3          3       /* Clock output divider bit 3 */
#define    BM_CLKOD3	(uint8_t)(1U<<CLKOD3)
#define    CLKOD4          4       /* Clock output divider bit 4 */
#define    BM_CLKOD4	(uint8_t)(1U<<CLKOD4)
#define    CLKOD5          5       /* Clock output divider bit 5 */
#define    BM_CLKOD5	(uint8_t)(1U<<CLKOD5)
#define    CLKOD6          6       /* Clock output divider bit 6 */
#define    BM_CLKOD6	(uint8_t)(1U<<CLKOD6)
#define    CLKOD7          7       /* Clock output divider bit 7 */
#define    BM_CLKOD7	(uint8_t)(1U<<CLKOD7)

/* CMOCR - Clock management override control register */
#define    FRCAO           0       /* FRC Always On */
#define    BM_FRCAO	(uint8_t)(1U<<FRCAO)
#define    MRCAO           1       /* MRC Always On */
#define    BM_MRCAO	(uint8_t)(1U<<MRCAO)
#define    FRCACT          2       /* FRC Active */
#define    BM_FRCACT	(uint8_t)(1U<<FRCACT)

/* CMSR - Clock management status Register */
#define    ECF             0       /* External clock fail */
#define    BM_ECF	(uint8_t)(1U<<ECF)

/* FRCCAL - Fast RC oscillator calibration Register */
#define    FRCCAL0         0       /* Fast RC oscillator calibration bit 0 */
#define    BM_FRCCAL0	(uint8_t)(1U<<FRCCAL0)
#define    FRCCAL1         1       /* Fast RC oscillator calibration bit 1 */
#define    BM_FRCCAL1	(uint8_t)(1U<<FRCCAL1)
#define    FRCCAL2         2       /* Fast RC oscillator calibration bit 2 */
#define    BM_FRCCAL2	(uint8_t)(1U<<FRCCAL2)
#define    FRCCAL3         3       /* Fast RC oscillator calibration bit 3 */
#define    BM_FRCCAL3	(uint8_t)(1U<<FRCCAL3)
#define    FRCCAL4         4       /* Fast RC oscillator calibration bit 4 */
#define    BM_FRCCAL4	(uint8_t)(1U<<FRCCAL4)

/* MRCCAL - Middle RC oscillator calibration Register */
#define    MRCCAL1         1       /* Middle RC oscillator calibration bit 1 */
#define    BM_MRCCAL1	(uint8_t)(1U<<MRCCAL1)
#define    MRCCAL2         2       /* Middle RC oscillator calibration bit 2 */
#define    BM_MRCCAL2	(uint8_t)(1U<<MRCCAL2)
#define    MRCCAL3         3       /* Middle RC oscillator calibration bit 3 */
#define    BM_MRCCAL3	(uint8_t)(1U<<MRCCAL3)
#define    MRCCAL4         4       /* Middle RC oscillator calibration bit 4 */
#define    BM_MRCCAL4	(uint8_t)(1U<<MRCCAL4)
#define    MRCCAL5         5       /* Middle RC oscillator calibration bit 5 */
#define    BM_MRCCAL5	(uint8_t)(1U<<MRCCAL5)
#define    MRCCAL6         6       /* Middle RC oscillator calibration bit 6 */
#define    BM_MRCCAL6	(uint8_t)(1U<<MRCCAL6)
#define    MRCCAL7         7       /* Middle RC oscillator calibration bit 7 */
#define    BM_MRCCAL7	(uint8_t)(1U<<MRCCAL7)

