camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* TRCDR - Trace Data Register */
#define    TRCDR0          0       /*  */
#define    BM_TRCDR0	(uint8_t)(1U<<TRCDR0)
#define    TRCDR1          1       /*  */
#define    BM_TRCDR1	(uint8_t)(1U<<TRCDR1)
#define    TRCDR2          2       /*  */
#define    BM_TRCDR2	(uint8_t)(1U<<TRCDR2)
#define    TRCDR3          3       /*  */
#define    BM_TRCDR3	(uint8_t)(1U<<TRCDR3)
#define    TRCDR4          4       /*  */
#define    BM_TRCDR4	(uint8_t)(1U<<TRCDR4)
#define    TRCDR5          5       /*  */
#define    BM_TRCDR5	(uint8_t)(1U<<TRCDR5)
#define    TRCDR6          6       /*  */
#define    BM_TRCDR6	(uint8_t)(1U<<TRCDR6)
#define    TRCDR7          7       /*  */
#define    BM_TRCDR7	(uint8_t)(1U<<TRCDR7)

/* TRCIDH - Trace ID Register High byte */
#define    TRCID8          0       /*  */
#define    BM_TRCID8	(uint8_t)(1U<<TRCID8)
#define    TRCID9          1       /*  */
#define    BM_TRCID9	(uint8_t)(1U<<TRCID9)
#define    TRCID10         2       /*  */
#define    BM_TRCID10	(uint8_t)(1U<<TRCID10)
#define    TRCID11         3       /*  */
#define    BM_TRCID11	(uint8_t)(1U<<TRCID11)
#define    TRCID12         4       /*  */
#define    BM_TRCID12	(uint8_t)(1U<<TRCID12)
#define    TRCID13         5       /*  */
#define    BM_TRCID13	(uint8_t)(1U<<TRCID13)
#define    TRCID14         6       /*  */
#define    BM_TRCID14	(uint8_t)(1U<<TRCID14)
#define    TRCID15         7       /*  */
#define    BM_TRCID15	(uint8_t)(1U<<TRCID15)

/* TRCIDL - Trace ID Register Low byte */
#define    TRCID0          0       /*  */
#define    BM_TRCID0	(uint8_t)(1U<<TRCID0)
#define    TRCID1          1       /*  */
#define    BM_TRCID1	(uint8_t)(1U<<TRCID1)
#define    TRCID2          2       /*  */
#define    BM_TRCID2	(uint8_t)(1U<<TRCID2)
#define    TRCID3          3       /*  */
#define    BM_TRCID3	(uint8_t)(1U<<TRCID3)
#define    TRCID4          4       /*  */
#define    BM_TRCID4	(uint8_t)(1U<<TRCID4)
#define    TRCID5          5       /*  */
#define    BM_TRCID5	(uint8_t)(1U<<TRCID5)
#define    TRCID6          6       /*  */
#define    BM_TRCID6	(uint8_t)(1U<<TRCID6)
#define    TRCID7          7       /*  */
#define    BM_TRCID7	(uint8_t)(1U<<TRCID7)


/* ***** DFIFO ************************ */
/* DFC - Data FIFO Configuration Register */
#define    DFFLC0          0       /* Data FIFO Fill-Level Configuration bit 0 */
#define    BM_DFFLC0	(uint8_t)(1U<<DFFLC0)
#define    DFFLC1          1       /* Data FIFO Fill-Level Configuration bit 1 */
#define    BM_DFFLC1	(uint8_t)(1U<<DFFLC1)
#define    DFFLC2          2       /* Data FIFO Fill-Level Configuration bit 2 */
#define    BM_DFFLC2	(uint8_t)(1U<<DFFLC2)
#define    DFFLC3          3       /* Data FIFO Fill-Level Configuration bit 3 */
#define    BM_DFFLC3	(uint8_t)(1U<<DFFLC3)
#define    DFFLC4          4       /* Data FIFO Fill-Level Configuration bit 4 */
#define    BM_DFFLC4	(uint8_t)(1U<<DFFLC4)
#define    DFFLC5          5       /* Data FIFO Fill-Level Configuration bit 5 */
#define    BM_DFFLC5	(uint8_t)(1U<<DFFLC5)
#define    DFDRA           7       /* Data FIFO Direct Read Access Operational Mode */
#define    BM_DFDRA	(uint8_t)(1U<<DFDRA)

/* DFI - Data FIFO Interrupt Mask Register */
#define    DFFLIM          0       /* Data FIFO Fill-level Interrupt Mask */
#define    BM_DFFLIM	(uint8_t)(1U<<DFFLIM)
#define    DFERIM          1       /* Data FIFO Error Interrupt Mask */
#define    BM_DFERIM	(uint8_t)(1U<<DFERIM)

/* DFL - Data FIFO Fill Level Register */
#define    DFFLS0          0       /* Data FIFO Fill Level Status bit 0 */
#define    BM_DFFLS0	(uint8_t)(1U<<DFFLS0)
#define    DFFLS1          1       /* Data FIFO Fill Level Status bit 1 */
#define    BM_DFFLS1	(uint8_t)(1U<<DFFLS1)
#define    DFFLS2          2       /* Data FIFO Fill Level Status bit 2 */
#define    BM_DFFLS2	(uint8_t)(1U<<DFFLS2)
#define    DFFLS3          3       /* Data FIFO Fill Level Status bit 3 */
#define    BM_DFFLS3	(uint8_t)(1U<<DFFLS3)
#define    DFFLS4          4       /* Data FIFO Fill Level Status bit 4 */
#define    BM_DFFLS4	(uint8_t)(1U<<DFFLS4)
#define    DFFLS5          5       /* Data FIFO Fill Level Status bit 5 */
#define    BM_DFFLS5	(uint8_t)(1U<<DFFLS5)
#define    DFCLR           7       /* Data FIFO Clear */
#define    BM_DFCLR	(uint8_t)(1U<<DFCLR)

/* DFRP - Data FIFO Read Pointer */
#define    DFRP0           0       /* Data FIFO Read Pointer bit 0 */
#define    BM_DFRP0	(uint8_t)(1U<<DFRP0)
#define    DFRP1           1       /* Data FIFO Read Pointer bit 1 */
#define    BM_DFRP1	(uint8_t)(1U<<DFRP1)
#define    DFRP2           2       /* Data FIFO Read Pointer bit 2 */
#define    BM_DFRP2	(uint8_t)(1U<<DFRP2)
#define    DFRP3           3       /* Data FIFO Read Pointer bit 3 */
#define    BM_DFRP3	(uint8_t)(1U<<DFRP3)
#define    DFRP4           4       /* Data FIFO Read Pointer bit 4 */
#define    BM_DFRP4	(uint8_t)(1U<<DFRP4)
#define    DFRP5           5       /* Data FIFO Read Pointer bit 5 */
#define    BM_DFRP5	(uint8_t)(1U<<DFRP5)

/* DFS - Data FIFO Status Register */
#define    DFFLRF          0       /* Data FIFO Fill-Level Reached Status Flag */
#define    BM_DFFLRF	(uint8_t)(1U<<DFFLRF)
#define    DFUFL           1       /* Data FIFO Underflow Flag */
#define    BM_DFUFL	(uint8_t)(1U<<DFUFL)
#define    DFOFL           2       /* Data FIFO Overflow Flag */
#define    BM_DFOFL	(uint8_t)(1U<<DFOFL)

/* DFWP - Data FIFO Write Pointer */
#define    DFWP0           0       /* Data FIFO Write Pointer bit 0 */
#define    BM_DFWP0	(uint8_t)(1U<<DFWP0)
#define    DFWP1           1       /* Data FIFO Write Pointer bit 1 */
#define    BM_DFWP1	(uint8_t)(1U<<DFWP1)
#define    DFWP2           2       /* Data FIFO Write Pointer bit 2 */
#define    BM_DFWP2	(uint8_t)(1U<<DFWP2)
#define    DFWP3           3       /* Data FIFO Write Pointer bit 3 */
#define    BM_DFWP3	(uint8_t)(1U<<DFWP3)
#define    DFWP4           4       /* Data FIFO Write Pointer bit 4 */
#define    BM_DFWP4	(uint8_t)(1U<<DFWP4)
#define    DFWP5           5       /* Data FIFO Write Pointer bit 5 */
#define    BM_DFWP5	(uint8_t)(1U<<DFWP5)


/* ***** EEPROM *********************** */
/* EEARH - EEPROM Address Register High Byte */
#define    EEAR8           0       /* EEPROM Read/Write Address bit 8 */
#define    BM_EEAR8	(uint8_t)(1U<<EEAR8)
#define    EEAR9           1       /* EEPROM Read/Write Address bit 9 */
#define    BM_EEAR9	(uint8_t)(1U<<EEAR9)
#define    EEAR10          2       /* EEPROM Read/Write Address bit 10 */
#define    BM_EEAR10	(uint8_t)(1U<<EEAR10)
#define    EEAR11          3       /* EEPROM Read/Write Address bit 11 */
#define    BM_EEAR11	(uint8_t)(1U<<EEAR11)

/* EEARL - EEPROM Address Register Low Byte */
#define    EEAR0           0       /* EEPROM Read/Write Address bit 0 */
#define    BM_EEAR0	(uint8_t)(1U<<EEAR0)
#define    EEAR1           1       /* EEPROM Read/Write Address bit 1 */
#define    BM_EEAR1	(uint8_t)(1U<<EEAR1)
#define    EEAR2           2       /* EEPROM Read/Write Address bit 2 */
#define    BM_EEAR2	(uint8_t)(1U<<EEAR2)
#define    EEAR3           3       /* EEPROM Read/Write Address bit 3 */
#define    BM_EEAR3	(uint8_t)(1U<<EEAR3)
#define    EEAR4           4       /* EEPROM Read/Write Address bit 4 */
#define    BM_EEAR4	(uint8_t)(1U<<EEAR4)
#define    EEAR5           5       /* EEPROM Read/Write Address bit 5 */
#define    BM_EEAR5	(uint8_t)(1U<<EEAR5)
#define    EEAR6           6       /* EEPROM Read/Write Address bit 6 */
#define    BM_EEAR6	(uint8_t)(1U<<EEAR6)
#define    EEAR7           7       /* EEPROM Read/Write Address bit 7 */
#define    BM_EEAR7	(uint8_t)(1U<<EEAR7)

/* EECR - EEPROM Control Register */
#define    EERE            0       /* EEPROM Read Enable */
#define    BM_EERE	(uint8_t)(1U<<EERE)
#define    EEWE            1       /* EEPROM Write Enable */
#define    BM_EEWE	(uint8_t)(1U<<EEWE)
#define    EEMWE           2       /* EEPROM Master Write Enable */
#define    BM_EEMWE	(uint8_t)(1U<<EEMWE)
#define    EERIE           3       /* EEPROM Ready Interrupt Enable */
#define    BM_EERIE	(uint8_t)(1U<<EERIE)
#define    EEPM0           4       /* EEPROM Programming Mode bit 0 */
#define    BM_EEPM0	(uint8_t)(1U<<EEPM0)
#define    EEPM1           5       /* EEPROM Programming Mode bit 1 */
#define    BM_EEPM1	(uint8_t)(1U<<EEPM1)
#define    EEPAGE          6       /* EEPROM page access (multiple bytes access mode) */
#define    BM_EEPAGE	(uint8_t)(1U<<EEPAGE)
#define    NVMBSY          7       /* Non-volatile memory busy */
#define    BM_NVMBSY	(uint8_t)(1U<<NVMBSY)

