camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* EECR2 - EEPROM Control Register 2 */
#define    EEBRE           0       /* EEPROM Burst Read Enable */
#define    BM_EEBRE	(uint8_t)(1U<<EEBRE)
#define    E2CIM           1       /* EEPROM Error Code Correction Interrupt Mask */
#define    BM_E2CIM	(uint8_t)(1U<<E2CIM)
#define    E2AVF           5       /* EEPROM Access Violation Flag */
#define    BM_E2AVF	(uint8_t)(1U<<E2AVF)
#define    E2FF            6       /* EEPROM error Fault Flag bit */
#define    BM_E2FF	(uint8_t)(1U<<E2FF)
#define    E2CF            7       /* EEPROM Error Correction Code Flag */
#define    BM_E2CF	(uint8_t)(1U<<E2CF)

/* EEPR0 - EEPROM Protection Register 0 */
#define    EEPS0WD         0       /* EEPROM Protection Section 0 Write Disable */
#define    BM_EEPS0WD	(uint8_t)(1U<<EEPS0WD)
#define    EEPS0RD         1       /* EEPROM Protection Section 0 Read Disable */
#define    BM_EEPS0RD	(uint8_t)(1U<<EEPS0RD)
#define    EEPS1WD         2       /* EEPROM Protection Section 1 Write Disable */
#define    BM_EEPS1WD	(uint8_t)(1U<<EEPS1WD)
#define    EEPS1RD         3       /* EEPROM Protection Section 1 Read Disable */
#define    BM_EEPS1RD	(uint8_t)(1U<<EEPS1RD)
#define    EEPS2WD         4       /* EEPROM Protection Section 2 Write Disable */
#define    BM_EEPS2WD	(uint8_t)(1U<<EEPS2WD)
#define    EEPS2RD         5       /* EEPROM Protection Section 2 Read Disable */
#define    BM_EEPS2RD	(uint8_t)(1U<<EEPS2RD)
#define    EEPS3WD         6       /* EEPROM Protection Section 3 Write Disable */
#define    BM_EEPS3WD	(uint8_t)(1U<<EEPS3WD)
#define    EEPS3RD         7       /* EEPROM Protection Section 3 Read Disable */
#define    BM_EEPS3RD	(uint8_t)(1U<<EEPS3RD)

/* EEPR1 - EEPROM Protection Register 1 */
#define    EEPS4WD         0       /* EEPROM Protection Section 4 Write Disable */
#define    BM_EEPS4WD	(uint8_t)(1U<<EEPS4WD)
#define    EEPS4RD         1       /* EEPROM Protection Section 4 Read Disable */
#define    BM_EEPS4RD	(uint8_t)(1U<<EEPS4RD)
#define    EEPS5WD         2       /* EEPROM Protection Section 5 Write Disable */
#define    BM_EEPS5WD	(uint8_t)(1U<<EEPS5WD)
#define    EEPS5RD         3       /* EEPROM Protection Section 5 Read Disable */
#define    BM_EEPS5RD	(uint8_t)(1U<<EEPS5RD)
#define    EEPS6WD         4       /* EEPROM Protection Section 6 Write Disable */
#define    BM_EEPS6WD	(uint8_t)(1U<<EEPS6WD)
#define    EEPS6RD         5       /* EEPROM Protection Section 6 Read Disable */
#define    BM_EEPS6RD	(uint8_t)(1U<<EEPS6RD)
#define    EEPS7WD         6       /* EEPROM Protection Section 7 Write Disable */
#define    BM_EEPS7WD	(uint8_t)(1U<<EEPS7WD)
#define    EEPS7RD         7       /* EEPROM Protection Section 7 Read Disable */
#define    BM_EEPS7RD	(uint8_t)(1U<<EEPS7RD)

/* EEPR2 - EEPROM Protection Register 2 */
#define    EEPS8WD         0       /* EEPROM Protection Section 8 Write Disable */
#define    BM_EEPS8WD	(uint8_t)(1U<<EEPS8WD)
#define    EEPS8RD         1       /* EEPROM Protection Section 8 Read Disable */
#define    BM_EEPS8RD	(uint8_t)(1U<<EEPS8RD)
#define    EEPS9WD         2       /* EEPROM Protection Section 9 Write Disable */
#define    BM_EEPS9WD	(uint8_t)(1U<<EEPS9WD)
#define    EEPS9RD         3       /* EEPROM Protection Section 9 Read Disable */
#define    BM_EEPS9RD	(uint8_t)(1U<<EEPS9RD)
#define    EEPS10WD        4       /* EEPROM Protection Section 10 Write Disableble */
#define    BM_EEPS10WD	(uint8_t)(1U<<EEPS10WD)
#define    EEPS10RD        5       /* EEPROM Protection Section 10 Read Disable */
#define    BM_EEPS10RD	(uint8_t)(1U<<EEPS10RD)
#define    EEPS11WD        6       /* EEPROM Protection Section 11 Write Disable */
#define    BM_EEPS11WD	(uint8_t)(1U<<EEPS11WD)
#define    EEPS11RD        7       /* EEPROM Protection Section 11 Read Disable */
#define    BM_EEPS11RD	(uint8_t)(1U<<EEPS11RD)

/* EEPR3 - EEPROM Protection Register 3 */
#define    EEPS12WD        0       /* EEPROM Protection Section 12 Write Disable */
#define    BM_EEPS12WD	(uint8_t)(1U<<EEPS12WD)
#define    EEPS12RD        1       /* EEPROM Protection Section 12 Read Disable */
#define    BM_EEPS12RD	(uint8_t)(1U<<EEPS12RD)


/* ***** FE *************************** */
/* FEALR - Front-End Antenna Level Detector Range */
#define    RNGE0           0       /* Range of the ANT_TUNE level detector bit 0 */
#define    BM_RNGE0	(uint8_t)(1U<<RNGE0)
#define    RNGE1           1       /* Range of the ANT_TUNE level detector bit 1 */
#define    BM_RNGE1	(uint8_t)(1U<<RNGE1)

/* FEANT - Front-End Antenna */
#define    LVLC0           0       /* antenna signal LeVeL bit 0 */
#define    BM_LVLC0	(uint8_t)(1U<<LVLC0)
#define    LVLC1           1       /* antenna signal LeVeL bit 1 */
#define    BM_LVLC1	(uint8_t)(1U<<LVLC1)
#define    LVLC2           2       /* antenna signal LeVeL bit 2 */
#define    BM_LVLC2	(uint8_t)(1U<<LVLC2)
#define    LVLC3           3       /* antenna signal LeVeL bit 3 */
#define    BM_LVLC3	(uint8_t)(1U<<LVLC3)

/* FEAT - Front-End Antenna Tuning */
#define    ANTN0           0       /* Antenna Tuning bit 0 */
#define    BM_ANTN0	(uint8_t)(1U<<ANTN0)
#define    ANTN1           1       /* Antenna Tuning bit 1 */
#define    BM_ANTN1	(uint8_t)(1U<<ANTN1)
#define    ANTN2           2       /* Antenna Tuning bit 2 */
#define    BM_ANTN2	(uint8_t)(1U<<ANTN2)
#define    ANTN3           3       /* Antenna Tuning bit 3 */
#define    BM_ANTN3	(uint8_t)(1U<<ANTN3)

/* FEBIA - Reserved */
#define    FEBIA_R0        0       /*  */
#define    BM_FEBIA_R0	(uint8_t)(1U<<FEBIA_R0)
#define    FEBIA_R1        1       /*  */
#define    BM_FEBIA_R1	(uint8_t)(1U<<FEBIA_R1)
#define    FEBIA_R2        2       /*  */
#define    BM_FEBIA_R2	(uint8_t)(1U<<FEBIA_R2)
#define    FEBIA_R3        3       /*  */
#define    BM_FEBIA_R3	(uint8_t)(1U<<FEBIA_R3)
#define    FEBIA_R4        4       /*  */
#define    BM_FEBIA_R4	(uint8_t)(1U<<FEBIA_R4)
#define    FEBIA_R5        5       /*  */
#define    BM_FEBIA_R5	(uint8_t)(1U<<FEBIA_R5)
#define    FEBIA_R6        6       /*  */
#define    BM_FEBIA_R6	(uint8_t)(1U<<FEBIA_R6)
#define    FEBIA_R7        7       /*  */
#define    BM_FEBIA_R7	(uint8_t)(1U<<FEBIA_R7)

/* FEBT - Front-End RC Tuning Register */
#define    CTN20           0       /* Capacitor Tuning bit 0 */
#define    BM_CTN20	(uint8_t)(1U<<CTN20)
#define    CTN21           1       /* Capacitor Tuning bit 1 */
#define    BM_CTN21	(uint8_t)(1U<<CTN21)
#define    RTN20           2       /* Resistor Tuning bit 0 */
#define    BM_RTN20	(uint8_t)(1U<<RTN20)
#define    RTN21           3       /* Resistor Tuning bit 1 */
#define    BM_RTN21	(uint8_t)(1U<<RTN21)

