camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* FECR - Front-End Control Register */
#define    LBNHB           0       /* Select Low-Band Not High-Band */
#define    BM_LBNHB	(uint8_t)(1U<<LBNHB)
#define    S4N3            1       /* Select 433 Not 315MHz Band */
#define    BM_S4N3	(uint8_t)(1U<<S4N3)
#define    FECR_R2         2       /*  */
#define    BM_FECR_R2	(uint8_t)(1U<<FECR_R2)
#define    FECR_R3         3       /*  */
#define    BM_FECR_R3	(uint8_t)(1U<<FECR_R3)
#define    PLCKG           4       /* PLL Lock Detect Gate */
#define    BM_PLCKG	(uint8_t)(1U<<PLCKG)
#define    ANPS            5       /* ASK Not DPSK Switch */
#define    BM_ANPS	(uint8_t)(1U<<ANPS)

/* FEEN1 - Front-End Enable Register 1 */
#define    PLEN            0       /* PLL enable */
#define    BM_PLEN	(uint8_t)(1U<<PLEN)
#define    PLCAL           1       /* PLL calibration mode */
#define    BM_PLCAL	(uint8_t)(1U<<PLCAL)
#define    XTOEN           2       /* Cristal Oscillator enable */
#define    BM_XTOEN	(uint8_t)(1U<<XTOEN)
#define    FEEN1_R3        3       /*  */
#define    BM_FEEN1_R3	(uint8_t)(1U<<FEEN1_R3)
#define    FEEN1_R4        4       /*  */
#define    BM_FEEN1_R4	(uint8_t)(1U<<FEEN1_R4)
#define    FEEN1_R5        5       /*  */
#define    BM_FEEN1_R5	(uint8_t)(1U<<FEEN1_R5)
#define    PLSP1           6       /* PLL Speedup 1 */
#define    BM_PLSP1	(uint8_t)(1U<<PLSP1)
#define    ATEN            7       /* Antenna Tuning Enable */
#define    BM_ATEN	(uint8_t)(1U<<ATEN)

/* FEEN2 - Front-End Enable Register 2 */
#define    FEEN2_R0        0       /*  */
#define    BM_FEEN2_R0	(uint8_t)(1U<<FEEN2_R0)
#define    FEEN2_R1        1       /*  */
#define    BM_FEEN2_R1	(uint8_t)(1U<<FEEN2_R1)
#define    PAEN            2       /* Power Amplifier enable */
#define    BM_PAEN	(uint8_t)(1U<<PAEN)
#define    FEEN2_R3        3       /*  */
#define    BM_FEEN2_R3	(uint8_t)(1U<<FEEN2_R3)
#define    PLPEN           4       /* PLL Post En IQ divider */
#define    BM_PLPEN	(uint8_t)(1U<<PLPEN)
#define    FEEN2_R5        5       /*  */
#define    BM_FEEN2_R5	(uint8_t)(1U<<FEEN2_R5)
#define    CPBIA           6       /* Cap Array Bias */
#define    BM_CPBIA	(uint8_t)(1U<<CPBIA)
#define    FEEN2_R7        7       /*  */
#define    BM_FEEN2_R7	(uint8_t)(1U<<FEEN2_R7)

/* FELNA - Reserved */
#define    FELNA_R0        0       /*  */
#define    BM_FELNA_R0	(uint8_t)(1U<<FELNA_R0)
#define    FELNA_R1        1       /*  */
#define    BM_FELNA_R1	(uint8_t)(1U<<FELNA_R1)
#define    FELNA_R2        2       /*  */
#define    BM_FELNA_R2	(uint8_t)(1U<<FELNA_R2)
#define    FELNA_R3        3       /*  */
#define    BM_FELNA_R3	(uint8_t)(1U<<FELNA_R3)
#define    FELNA_R4        4       /*  */
#define    BM_FELNA_R4	(uint8_t)(1U<<FELNA_R4)
#define    FELNA_R5        5       /*  */
#define    BM_FELNA_R5	(uint8_t)(1U<<FELNA_R5)
#define    FELNA_R6        6       /*  */
#define    BM_FELNA_R6	(uint8_t)(1U<<FELNA_R6)
#define    FELNA_R7        7       /*  */
#define    BM_FELNA_R7	(uint8_t)(1U<<FELNA_R7)

/* FEMS - Front-End Main and Swallow Control Register */
#define    PLLS0           0       /* PLL Swallow bit 0 */
#define    BM_PLLS0	(uint8_t)(1U<<PLLS0)
#define    PLLS1           1       /* PLL Swallow bit 1 */
#define    BM_PLLS1	(uint8_t)(1U<<PLLS1)
#define    PLLS2           2       /* PLL Swallow bit 2 */
#define    BM_PLLS2	(uint8_t)(1U<<PLLS2)
#define    PLLS3           3       /* PLL Swallow bit 3 */
#define    BM_PLLS3	(uint8_t)(1U<<PLLS3)
#define    PLLM0           4       /* PLL Mode bit 0 */
#define    BM_PLLM0	(uint8_t)(1U<<PLLM0)
#define    PLLM1           5       /* PLL Mode bit 1 */
#define    BM_PLLM1	(uint8_t)(1U<<PLLM1)
#define    PLLM2           6       /* PLL Mode bit 2 */
#define    BM_PLLM2	(uint8_t)(1U<<PLLM2)
#define    PLLM3           7       /* PLL Mode bit 3 */
#define    BM_PLLM3	(uint8_t)(1U<<PLLM3)

/* FEPAC - Front-End Power Amplifier Control Register */
#define    PACR0           0       /* Power Amplifier Control Register bit 0 */
#define    BM_PACR0	(uint8_t)(1U<<PACR0)
#define    PACR1           1       /* Power Amplifier Control Register bit 1 */
#define    BM_PACR1	(uint8_t)(1U<<PACR1)
#define    PACR2           2       /* Power Amplifier Control Register bit 2 */
#define    BM_PACR2	(uint8_t)(1U<<PACR2)
#define    PACR3           3       /* Power Amplifier Control Register bit 3 */
#define    BM_PACR3	(uint8_t)(1U<<PACR3)
#define    PACR4           4       /* Power Amplifier Control Register bit 4 */
#define    BM_PACR4	(uint8_t)(1U<<PACR4)
#define    PACR5           5       /* Power Amplifier Control Register bit 5 */
#define    BM_PACR5	(uint8_t)(1U<<PACR5)
#define    PACR6           6       /* Power Amplifier Control Register bit 6 */
#define    BM_PACR6	(uint8_t)(1U<<PACR6)
#define    PACR7           7       /* Power Amplifier Control Register bit 7 */
#define    BM_PACR7	(uint8_t)(1U<<PACR7)

/* FESR - Front-End Status Register */
#define    XRDY            2       /* XTO ready */
#define    BM_XRDY	(uint8_t)(1U<<XRDY)
#define    PLCK            3       /* PLL locked */
#define    BM_PLCK	(uint8_t)(1U<<PLCK)
#define    ANTS            4       /* Antenna saturated */
#define    BM_ANTS	(uint8_t)(1U<<ANTS)

/* FETD - Front-End Test Data Register */
#define    FETM0           0       /*  */
#define    BM_FETM0	(uint8_t)(1U<<FETM0)
#define    FETM1           1       /*  */
#define    BM_FETM1	(uint8_t)(1U<<FETM1)
#define    FETM2           2       /*  */
#define    BM_FETM2	(uint8_t)(1U<<FETM2)
#define    FETM3           3       /*  */
#define    BM_FETM3	(uint8_t)(1U<<FETM3)
#define    FETM4           4       /*  */
#define    BM_FETM4	(uint8_t)(1U<<FETM4)
#define    FETM5           5       /*  */
#define    BM_FETM5	(uint8_t)(1U<<FETM5)
#define    FETM6           6       /*  */
#define    BM_FETM6	(uint8_t)(1U<<FETM6)
#define    FETM7           7       /*  */
#define    BM_FETM7	(uint8_t)(1U<<FETM7)

/* FETE1 - Front-End Test Enable Register 1 */
#define    ADCT            0       /*  */
#define    BM_ADCT	(uint8_t)(1U<<ADCT)
#define    XTOT            1       /*  */
#define    BM_XTOT	(uint8_t)(1U<<XTOT)
#define    LNLT            2       /*  */
#define    BM_LNLT	(uint8_t)(1U<<LNLT)
#define    LNHT            3       /*  */
#define    BM_LNHT	(uint8_t)(1U<<LNHT)
#define    PATE            4       /*  */
#define    BM_PATE	(uint8_t)(1U<<PATE)
#define    AMPT            5       /*  */
#define    BM_AMPT	(uint8_t)(1U<<AMPT)
#define    VCOT            6       /*  */
#define    BM_VCOT	(uint8_t)(1U<<VCOT)
#define    ANTN            7       /*  */
#define    BM_ANTN	(uint8_t)(1U<<ANTN)

/* FETE2 - Front-End Test Enable Register 2 */
#define    RCCT            0       /*  */
#define    BM_RCCT	(uint8_t)(1U<<RCCT)
#define    PPFT            1       /*  */
#define    BM_PPFT	(uint8_t)(1U<<PPFT)
#define    LFT             2       /*  */
#define    BM_LFT	(uint8_t)(1U<<LFT)
#define    CPT             3       /*  */
#define    BM_CPT	(uint8_t)(1U<<CPT)
#define    PFDT            4       /*  */
#define    BM_PFDT	(uint8_t)(1U<<PFDT)
#define    DADCT           5       /*  */
#define    BM_DADCT	(uint8_t)(1U<<DADCT)
#define    PRET            6       /*  */
#define    BM_PRET	(uint8_t)(1U<<PRET)
#define    SWALT           7       /*  */
#define    BM_SWALT	(uint8_t)(1U<<SWALT)

/* FETE3 - Front-End Test Enable Register 3 */
#define    BIOUT           0       /*  */
#define    BM_BIOUT	(uint8_t)(1U<<BIOUT)
#define    RMPTST          1       /*  */
#define    BM_RMPTST	(uint8_t)(1U<<RMPTST)
#define    FETE3_R2        2       /*  */
#define    BM_FETE3_R2	(uint8_t)(1U<<FETE3_R2)
#define    FETE3_R3        3       /*  */
#define    BM_FETE3_R3	(uint8_t)(1U<<FETE3_R3)
#define    FETE3_R4        4       /*  */
#define    BM_FETE3_R4	(uint8_t)(1U<<FETE3_R4)
#define    FETE3_R5        5       /*  */
#define    BM_FETE3_R5	(uint8_t)(1U<<FETE3_R5)
#define    FETE3_R6        6       /*  */
#define    BM_FETE3_R6	(uint8_t)(1U<<FETE3_R6)
#define    FETE3_R7        7       /*  */
#define    BM_FETE3_R7	(uint8_t)(1U<<FETE3_R7)

