camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* FETN4 - Front-End RC Tuning 4bit Register */
#define    CTN40           0       /* 4 bit Capacitor Tuning bit 0 */
#define    BM_CTN40	(uint8_t)(1U<<CTN40)
#define    CTN41           1       /* 4 bit Capacitor Tuning bit 1 */
#define    BM_CTN41	(uint8_t)(1U<<CTN41)
#define    CTN42           2       /* 4 bit Capacitor Tuning bit 2 */
#define    BM_CTN42	(uint8_t)(1U<<CTN42)
#define    CTN43           3       /* 4 bit Capacitor Tuning bit 3 */
#define    BM_CTN43	(uint8_t)(1U<<CTN43)
#define    RTN40           4       /* 4 bit Resistor Tuning bit 0 */
#define    BM_RTN40	(uint8_t)(1U<<RTN40)
#define    RTN41           5       /* 4 bit Resistor Tuning bit 1 */
#define    BM_RTN41	(uint8_t)(1U<<RTN41)
#define    RTN42           6       /* 4 bit Resistor Tuning bit 2 */
#define    BM_RTN42	(uint8_t)(1U<<RTN42)
#define    RTN43           7       /* 4 bit Resistor Tuning bit 3 */
#define    BM_RTN43	(uint8_t)(1U<<RTN43)

/* FEVCO - Front-End VCO and PLL control */
#define    CPCC0           0       /* Charge pump current control bit 0 */
#define    BM_CPCC0	(uint8_t)(1U<<CPCC0)
#define    CPCC1           1       /* Charge pump current control bit 1 */
#define    BM_CPCC1	(uint8_t)(1U<<CPCC1)
#define    CPCC2           2       /* Charge pump current control bit 2 */
#define    BM_CPCC2	(uint8_t)(1U<<CPCC2)
#define    CPCC3           3       /* Charge pump current control bit 3 */
#define    BM_CPCC3	(uint8_t)(1U<<CPCC3)
#define    VCOB0           4       /* VCO Bias bit 0 */
#define    BM_VCOB0	(uint8_t)(1U<<VCOB0)
#define    VCOB1           5       /* VCO Bias bit 1 */
#define    BM_VCOB1	(uint8_t)(1U<<VCOB1)
#define    VCOB2           6       /* VCO Bias bit 2 */
#define    BM_VCOB2	(uint8_t)(1U<<VCOB2)
#define    VCOB3           7       /* VCO Bias bit 3 */
#define    BM_VCOB3	(uint8_t)(1U<<VCOB3)

/* FEVCT - Front-End VCO Tuning Register */
#define    FEVCT0          0       /* Front-End VCO Tuning Register bit 0 */
#define    BM_FEVCT0	(uint8_t)(1U<<FEVCT0)
#define    FEVCT1          1       /* Front-End VCO Tuning Register bit 1 */
#define    BM_FEVCT1	(uint8_t)(1U<<FEVCT1)
#define    FEVCT2          2       /* Front-End VCO Tuning Register bit 2 */
#define    BM_FEVCT2	(uint8_t)(1U<<FEVCT2)
#define    FEVCT3          3       /* Front-End VCO Tuning Register bit 3 */
#define    BM_FEVCT3	(uint8_t)(1U<<FEVCT3)
#define    FEVCT_R4        4       /*  */
#define    BM_FEVCT_R4	(uint8_t)(1U<<FEVCT_R4)
#define    FEVCT_R5        5       /*  */
#define    BM_FEVCT_R5	(uint8_t)(1U<<FEVCT_R5)
#define    FEVCT_R6        6       /*  */
#define    BM_FEVCT_R6	(uint8_t)(1U<<FEVCT_R6)
#define    FEVCT_R7        7       /*  */
#define    BM_FEVCT_R7	(uint8_t)(1U<<FEVCT_R7)

/* SPARE1 - Front-End Spare Register 1 */
#define    SPARE10         0       /*  */
#define    BM_SPARE10	(uint8_t)(1U<<SPARE10)
#define    SPARE11         1       /*  */
#define    BM_SPARE11	(uint8_t)(1U<<SPARE11)
#define    SPARE12         2       /*  */
#define    BM_SPARE12	(uint8_t)(1U<<SPARE12)
#define    SPARE13         3       /*  */
#define    BM_SPARE13	(uint8_t)(1U<<SPARE13)
#define    SPARE14         4       /*  */
#define    BM_SPARE14	(uint8_t)(1U<<SPARE14)
#define    SPARE15         5       /*  */
#define    BM_SPARE15	(uint8_t)(1U<<SPARE15)
#define    SPARE16         6       /*  */
#define    BM_SPARE16	(uint8_t)(1U<<SPARE16)
#define    SPARE17         7       /*  */
#define    BM_SPARE17	(uint8_t)(1U<<SPARE17)

/* SPARE2 - Front-End Spare Register 2 */
#define    SPARE20         0       /*  */
#define    BM_SPARE20	(uint8_t)(1U<<SPARE20)
#define    SPARE21         1       /*  */
#define    BM_SPARE21	(uint8_t)(1U<<SPARE21)
#define    SPARE22         2       /*  */
#define    BM_SPARE22	(uint8_t)(1U<<SPARE22)
#define    SPARE23         3       /*  */
#define    BM_SPARE23	(uint8_t)(1U<<SPARE23)
#define    SPARE24         4       /*  */
#define    BM_SPARE24	(uint8_t)(1U<<SPARE24)
#define    SPARE25         5       /*  */
#define    BM_SPARE25	(uint8_t)(1U<<SPARE25)
#define    SPARE26         6       /*  */
#define    BM_SPARE26	(uint8_t)(1U<<SPARE26)
#define    SPARE27         7       /*  */
#define    BM_SPARE27	(uint8_t)(1U<<SPARE27)

/* SPARE3 - Front-End Spare Register 3 */
#define    SPARE30         0       /*  */
#define    BM_SPARE30	(uint8_t)(1U<<SPARE30)
#define    SPARE31         1       /*  */
#define    BM_SPARE31	(uint8_t)(1U<<SPARE31)
#define    SPARE32         2       /*  */
#define    BM_SPARE32	(uint8_t)(1U<<SPARE32)
#define    SPARE33         3       /*  */
#define    BM_SPARE33	(uint8_t)(1U<<SPARE33)
#define    SPARE34         4       /*  */
#define    BM_SPARE34	(uint8_t)(1U<<SPARE34)
#define    SPARE35         5       /*  */
#define    BM_SPARE35	(uint8_t)(1U<<SPARE35)
#define    SPARE36         6       /*  */
#define    BM_SPARE36	(uint8_t)(1U<<SPARE36)
#define    SPARE37         7       /*  */
#define    BM_SPARE37	(uint8_t)(1U<<SPARE37)

/* SPARE4 - Front-End Spare Register 4 */
#define    SPARE40         0       /*  */
#define    BM_SPARE40	(uint8_t)(1U<<SPARE40)
#define    SPARE41         1       /*  */
#define    BM_SPARE41	(uint8_t)(1U<<SPARE41)
#define    SPARE42         2       /*  */
#define    BM_SPARE42	(uint8_t)(1U<<SPARE42)
#define    SPARE43         3       /*  */
#define    BM_SPARE43	(uint8_t)(1U<<SPARE43)
#define    SPARE44         4       /*  */
#define    BM_SPARE44	(uint8_t)(1U<<SPARE44)
#define    SPARE45         5       /*  */
#define    BM_SPARE45	(uint8_t)(1U<<SPARE45)
#define    SPARE46         6       /*  */
#define    BM_SPARE46	(uint8_t)(1U<<SPARE46)
#define    SPARE47         7       /*  */
#define    BM_SPARE47	(uint8_t)(1U<<SPARE47)


/* ***** GPIOREGS_DVCC **************** */
/* GPIOR0 - General Purpose I/O Register 0 */
#define    GPIOR00         0       /*  */
#define    BM_GPIOR00	(uint8_t)(1U<<GPIOR00)
#define    GPIOR01         1       /*  */
#define    BM_GPIOR01	(uint8_t)(1U<<GPIOR01)
#define    GPIOR02         2       /*  */
#define    BM_GPIOR02	(uint8_t)(1U<<GPIOR02)
#define    GPIOR03         3       /*  */
#define    BM_GPIOR03	(uint8_t)(1U<<GPIOR03)
#define    GPIOR04         4       /*  */
#define    BM_GPIOR04	(uint8_t)(1U<<GPIOR04)
#define    GPIOR05         5       /*  */
#define    BM_GPIOR05	(uint8_t)(1U<<GPIOR05)
#define    GPIOR06         6       /*  */
#define    BM_GPIOR06	(uint8_t)(1U<<GPIOR06)
#define    GPIOR07         7       /*  */
#define    BM_GPIOR07	(uint8_t)(1U<<GPIOR07)

/* GPIOR1 - General Purpose I/O Register 1 */
#define    GPIOR10         0       /*  */
#define    BM_GPIOR10	(uint8_t)(1U<<GPIOR10)
#define    GPIOR11         1       /*  */
#define    BM_GPIOR11	(uint8_t)(1U<<GPIOR11)
#define    GPIOR12         2       /*  */
#define    BM_GPIOR12	(uint8_t)(1U<<GPIOR12)
#define    GPIOR13         3       /*  */
#define    BM_GPIOR13	(uint8_t)(1U<<GPIOR13)
#define    GPIOR14         4       /*  */
#define    BM_GPIOR14	(uint8_t)(1U<<GPIOR14)
#define    GPIOR15         5       /*  */
#define    BM_GPIOR15	(uint8_t)(1U<<GPIOR15)
#define    GPIOR16         6       /*  */
#define    BM_GPIOR16	(uint8_t)(1U<<GPIOR16)
#define    GPIOR17         7       /*  */
#define    BM_GPIOR17	(uint8_t)(1U<<GPIOR17)

/* GPIOR2 - General Purpose I/O Register 2 */
#define    GPIOR20         0       /*  */
#define    BM_GPIOR20	(uint8_t)(1U<<GPIOR20)
#define    GPIOR21         1       /*  */
#define    BM_GPIOR21	(uint8_t)(1U<<GPIOR21)
#define    GPIOR22         2       /*  */
#define    BM_GPIOR22	(uint8_t)(1U<<GPIOR22)
#define    GPIOR23         3       /*  */
#define    BM_GPIOR23	(uint8_t)(1U<<GPIOR23)
#define    GPIOR24         4       /*  */
#define    BM_GPIOR24	(uint8_t)(1U<<GPIOR24)
#define    GPIOR25         5       /*  */
#define    BM_GPIOR25	(uint8_t)(1U<<GPIOR25)
#define    GPIOR26         6       /*  */
#define    BM_GPIOR26	(uint8_t)(1U<<GPIOR26)
#define    GPIOR27         7       /*  */
#define    BM_GPIOR27	(uint8_t)(1U<<GPIOR27)


/* ***** GPIOREGS_LFVCC *************** */
/* GPIOR3 - General Purpose I/O Register 3 */
#define    GPIOR30         0       /*  */
#define    BM_GPIOR30	(uint8_t)(1U<<GPIOR30)
#define    GPIOR31         1       /*  */
#define    BM_GPIOR31	(uint8_t)(1U<<GPIOR31)
#define    GPIOR32         2       /*  */
#define    BM_GPIOR32	(uint8_t)(1U<<GPIOR32)
#define    GPIOR33         3       /*  */
#define    BM_GPIOR33	(uint8_t)(1U<<GPIOR33)
#define    GPIOR34         4       /*  */
#define    BM_GPIOR34	(uint8_t)(1U<<GPIOR34)
#define    GPIOR35         5       /*  */
#define    BM_GPIOR35	(uint8_t)(1U<<GPIOR35)
#define    GPIOR36         6       /*  */
#define    BM_GPIOR36	(uint8_t)(1U<<GPIOR36)
#define    GPIOR37         7       /*  */
#define    BM_GPIOR37	(uint8_t)(1U<<GPIOR37)

/* GPIOR4 - General Purpose I/O Register 4 */
#define    GPIOR40         0       /*  */
#define    BM_GPIOR40	(uint8_t)(1U<<GPIOR40)
#define    GPIOR41         1       /*  */
#define    BM_GPIOR41	(uint8_t)(1U<<GPIOR41)
#define    GPIOR42         2       /*  */
#define    BM_GPIOR42	(uint8_t)(1U<<GPIOR42)
#define    GPIOR43         3       /*  */
#define    BM_GPIOR43	(uint8_t)(1U<<GPIOR43)
#define    GPIOR44         4       /*  */
#define    BM_GPIOR44	(uint8_t)(1U<<GPIOR44)
#define    GPIOR45         5       /*  */
#define    BM_GPIOR45	(uint8_t)(1U<<GPIOR45)
#define    GPIOR46         6       /*  */
#define    BM_GPIOR46	(uint8_t)(1U<<GPIOR46)
#define    GPIOR47         7       /*  */
#define    BM_GPIOR47	(uint8_t)(1U<<GPIOR47)

/* GPIOR5 - General Purpose I/O Register 5 */
#define    GPIOR50         0       /*  */
#define    BM_GPIOR50	(uint8_t)(1U<<GPIOR50)
#define    GPIOR51         1       /*  */
#define    BM_GPIOR51	(uint8_t)(1U<<GPIOR51)
#define    GPIOR52         2       /*  */
#define    BM_GPIOR52	(uint8_t)(1U<<GPIOR52)
#define    GPIOR53         3       /*  */
#define    BM_GPIOR53	(uint8_t)(1U<<GPIOR53)
#define    GPIOR54         4       /*  */
#define    BM_GPIOR54	(uint8_t)(1U<<GPIOR54)
#define    GPIOR55         5       /*  */
#define    BM_GPIOR55	(uint8_t)(1U<<GPIOR55)
#define    GPIOR56         6       /*  */
#define    BM_GPIOR56	(uint8_t)(1U<<GPIOR56)
#define    GPIOR57         7       /*  */
#define    BM_GPIOR57	(uint8_t)(1U<<GPIOR57)

/* GPIOR6 - General Purpose I/O Register 6 */
#define    GPIOR60         0       /*  */
#define    BM_GPIOR60	(uint8_t)(1U<<GPIOR60)
#define    GPIOR61         1       /*  */
#define    BM_GPIOR61	(uint8_t)(1U<<GPIOR61)
#define    GPIOR62         2       /*  */
#define    BM_GPIOR62	(uint8_t)(1U<<GPIOR62)
#define    GPIOR63         3       /*  */
#define    BM_GPIOR63	(uint8_t)(1U<<GPIOR63)
#define    GPIOR64         4       /*  */
#define    BM_GPIOR64	(uint8_t)(1U<<GPIOR64)
#define    GPIOR65         5       /*  */
#define    BM_GPIOR65	(uint8_t)(1U<<GPIOR65)
#define    GPIOR66         6       /*  */
#define    BM_GPIOR66	(uint8_t)(1U<<GPIOR66)
#define    GPIOR67         7       /*  */
#define    BM_GPIOR67	(uint8_t)(1U<<GPIOR67)

/* GPIOR7 - General Purpose I/O Register 7 */
#define    GPIOR70         0       /*  */
#define    BM_GPIOR70	(uint8_t)(1U<<GPIOR70)
#define    GPIOR71         1       /*  */
#define    BM_GPIOR71	(uint8_t)(1U<<GPIOR71)
#define    GPIOR72         2       /*  */
#define    BM_GPIOR72	(uint8_t)(1U<<GPIOR72)
#define    GPIOR73         3       /*  */
#define    BM_GPIOR73	(uint8_t)(1U<<GPIOR73)
#define    GPIOR74         4       /*  */
#define    BM_GPIOR74	(uint8_t)(1U<<GPIOR74)
#define    GPIOR75         5       /*  */
#define    BM_GPIOR75	(uint8_t)(1U<<GPIOR75)
#define    GPIOR76         6       /*  */
#define    BM_GPIOR76	(uint8_t)(1U<<GPIOR76)
#define    GPIOR77         7       /*  */
#define    BM_GPIOR77	(uint8_t)(1U<<GPIOR77)

/* GPIOR8 - General Purpose I/O Register 8 */
#define    GPIOR80         0       /*  */
#define    BM_GPIOR80	(uint8_t)(1U<<GPIOR80)
#define    GPIOR81         1       /*  */
#define    BM_GPIOR81	(uint8_t)(1U<<GPIOR81)
#define    GPIOR82         2       /*  */
#define    BM_GPIOR82	(uint8_t)(1U<<GPIOR82)
#define    GPIOR83         3       /*  */
#define    BM_GPIOR83	(uint8_t)(1U<<GPIOR83)
#define    GPIOR84         4       /*  */
#define    BM_GPIOR84	(uint8_t)(1U<<GPIOR84)
#define    GPIOR85         5       /*  */
#define    BM_GPIOR85	(uint8_t)(1U<<GPIOR85)
#define    GPIOR86         6       /*  */
#define    BM_GPIOR86	(uint8_t)(1U<<GPIOR86)
#define    GPIOR87         7       /*  */
#define    BM_GPIOR87	(uint8_t)(1U<<GPIOR87)


