camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* ***** INT ************************** */
/* EICRA - External Interrupt control Register */
#define    ISC00           0       /* Interrupt Sense Control 0 bit 0 */
#define    BM_ISC00	(uint8_t)(1U<<ISC00)
#define    ISC01           1       /* Interrupt Sense Control 0 bit 1 */
#define    BM_ISC01	(uint8_t)(1U<<ISC01)
#define    ISC10           2       /* Interrupt Sense Control 1 bit 0 */
#define    BM_ISC10	(uint8_t)(1U<<ISC10)
#define    ISC11           3       /* Interrupt Sense Control 1 bit 1 */
#define    BM_ISC11	(uint8_t)(1U<<ISC11)

/* EIFR - External Interrupt Flag Register */
#define    INTF0           0       /* External Interrupt Flag 0 */
#define    BM_INTF0	(uint8_t)(1U<<INTF0)
#define    INTF1           1       /* External Interrupt Flag 1 */
#define    BM_INTF1	(uint8_t)(1U<<INTF1)

/* EIMSK - External Interrupt Mask Register */
#define    INT0            0       /* External Interrupt Request 0 Enable */
#define    BM_INT0	(uint8_t)(1U<<INT0)
#define    INT1            1       /* External Interrupt Request 1 Enable */
#define    BM_INT1	(uint8_t)(1U<<INT1)

/* PCICR - Pin change Interrupt control Register */
#define    PCIE0           0       /* Pin Change Interrupt Enable 0 */
#define    BM_PCIE0	(uint8_t)(1U<<PCIE0)
#define    PCIE1           1       /* Pin Change Interrupt Enable 1 */
#define    BM_PCIE1	(uint8_t)(1U<<PCIE1)

/* PCIFR - Pin change Interrupt flag Register */
#define    PCIF0           0       /* Pin Change Interrupt Flag 0 */
#define    BM_PCIF0	(uint8_t)(1U<<PCIF0)
#define    PCIF1           1       /* Pin Change Interrupt Flag 1 */
#define    BM_PCIF1	(uint8_t)(1U<<PCIF1)

/* PCMSK0 - Pin change Mask Register 0 */
#define    PCINT0          0       /* Pin Change Enable Mask bit 0 */
#define    BM_PCINT0	(uint8_t)(1U<<PCINT0)
#define    PCINT1          1       /* Pin Change Enable Mask bit 1 */
#define    BM_PCINT1	(uint8_t)(1U<<PCINT1)
#define    PCINT2          2       /* Pin Change Enable Mask bit 2 */
#define    BM_PCINT2	(uint8_t)(1U<<PCINT2)
#define    PCINT3          3       /* Pin Change Enable Mask bit 3 */
#define    BM_PCINT3	(uint8_t)(1U<<PCINT3)
#define    PCINT4          4       /* Pin Change Enable Mask bit 4 */
#define    BM_PCINT4	(uint8_t)(1U<<PCINT4)
#define    PCINT5          5       /* Pin Change Enable Mask bit 5 */
#define    BM_PCINT5	(uint8_t)(1U<<PCINT5)
#define    PCINT6          6       /* Pin Change Enable Mask bit 6 */
#define    BM_PCINT6	(uint8_t)(1U<<PCINT6)
#define    PCINT7          7       /* Pin Change Enable Mask bit 7 */
#define    BM_PCINT7	(uint8_t)(1U<<PCINT7)

/* PCMSK1 - Pin change Mask Register 1 */
#define    PCINT8          0       /* Pin Change Enable Mask bit 8 */
#define    BM_PCINT8	(uint8_t)(1U<<PCINT8)
#define    PCINT9          1       /* Pin Change Enable Mask bit 9 */
#define    BM_PCINT9	(uint8_t)(1U<<PCINT9)
#define    PCINT10         2       /* Pin Change Enable Mask bit 10 */
#define    BM_PCINT10	(uint8_t)(1U<<PCINT10)
#define    PCINT11         3       /* Pin Change Enable Mask bit 11 */
#define    BM_PCINT11	(uint8_t)(1U<<PCINT11)
#define    PCINT12         4       /* Pin Change Enable Mask bit 12 */
#define    BM_PCINT12	(uint8_t)(1U<<PCINT12)
#define    PCINT13         5       /* Pin Change Enable Mask bit 13 */
#define    BM_PCINT13	(uint8_t)(1U<<PCINT13)
#define    PCINT14         6       /* Pin Change Enable Mask bit 14 */
#define    BM_PCINT14	(uint8_t)(1U<<PCINT14)
#define    PCINT15         7       /* Pin Change Enable Mask bit 15 */
#define    BM_PCINT15	(uint8_t)(1U<<PCINT15)


/* ***** LED ************************** */
/* PDSCR - Pad Driver Strength Control Register */
#define    PDSC0           0       /* Pad Driver Strength Control bit 0 */
#define    BM_PDSC0	(uint8_t)(1U<<PDSC0)
#define    PDSC1           1       /* Pad Driver Strength Control bit 1 */
#define    BM_PDSC1	(uint8_t)(1U<<PDSC1)
#define    PDSC2           2       /* Pad Driver Strength Control bit 2 */
#define    BM_PDSC2	(uint8_t)(1U<<PDSC2)
#define    PDSC3           3       /* Pad Driver Strength Control bit 3 */
#define    BM_PDSC3	(uint8_t)(1U<<PDSC3)
#define    PDSC4           4       /* Pad Driver Strength Control bit 4 */
#define    BM_PDSC4	(uint8_t)(1U<<PDSC4)
#define    STBTEST         5       /* Standby Test Enable */
#define    BM_STBTEST	(uint8_t)(1U<<STBTEST)
#define    RSSISEL         6       /* Testmode Enable for RSSI Measurement */
#define    BM_RSSISEL	(uint8_t)(1U<<RSSISEL)
#define    ATBSEL          7       /* Analog Testbus Select */
#define    BM_ATBSEL	(uint8_t)(1U<<ATBSEL)


/* ***** LF_FIFO ********************** */
/* LDFC - LF Data FIFO Configuration Register */
#define    LDFFLC0         0       /* LF Data FIFO Fill-Level Configuration bit 0 */
#define    BM_LDFFLC0	(uint8_t)(1U<<LDFFLC0)
#define    LDFFLC1         1       /* LF Data FIFO Fill-Level Configuration bit 1 */
#define    BM_LDFFLC1	(uint8_t)(1U<<LDFFLC1)
#define    LDFFLC2         2       /* LF Data FIFO Fill-Level Configuration bit 2 */
#define    BM_LDFFLC2	(uint8_t)(1U<<LDFFLC2)
#define    LDFFLC3         3       /* LF Data FIFO Fill-Level Configuration bit 3 */
#define    BM_LDFFLC3	(uint8_t)(1U<<LDFFLC3)
#define    LDFFLC4         4       /* LF Data FIFO Fill-Level Configuration bit 4 */
#define    BM_LDFFLC4	(uint8_t)(1U<<LDFFLC4)
#define    LDFFLC5         5       /* LF Data FIFO Fill-Level Configuration bit 5 */
#define    BM_LDFFLC5	(uint8_t)(1U<<LDFFLC5)
#define    LDFMSB          6       /* LF Data FIFO MSB alignment bit */
#define    BM_LDFMSB	(uint8_t)(1U<<LDFMSB)

/* LDFCKSW - LF Data FIFO Clock Switch Register */
#define    LDFSCSW         0       /* LF Data FIFO Synchronous Clock Switch */
#define    BM_LDFSCSW	(uint8_t)(1U<<LDFSCSW)
#define    LDFSCKS         1       /* LF Data FIFO Synchronous Clock Status */
#define    BM_LDFSCKS	(uint8_t)(1U<<LDFSCKS)

/* LDFFL - LF Data FIFO Fill Level Register */
#define    LDFFL0          0       /* LF Data Fifo Fill Level bit 0 */
#define    BM_LDFFL0	(uint8_t)(1U<<LDFFL0)
#define    LDFFL1          1       /* LF Data Fifo Fill Level bit 1 */
#define    BM_LDFFL1	(uint8_t)(1U<<LDFFL1)
#define    LDFFL2          2       /* LF Data Fifo Fill Level bit 2 */
#define    BM_LDFFL2	(uint8_t)(1U<<LDFFL2)
#define    LDFFL3          3       /* LF Data Fifo Fill Level bit 3 */
#define    BM_LDFFL3	(uint8_t)(1U<<LDFFL3)
#define    LDFFL4          4       /* LF Data Fifo Fill Level bit 4 */
#define    BM_LDFFL4	(uint8_t)(1U<<LDFFL4)
#define    LDFFL5          5       /* LF Data Fifo Fill Level bit 5 */
#define    BM_LDFFL5	(uint8_t)(1U<<LDFFL5)
#define    LDFCLR          7       /* LF Data FIFO Clear */
#define    BM_LDFCLR	(uint8_t)(1U<<LDFCLR)

/* LDFIM - LF Data FIFO Interrupt Mask Register */
#define    LDFFLIM         0       /* LF Data FIFO Fill-level Interrupt Mask */
#define    BM_LDFFLIM	(uint8_t)(1U<<LDFFLIM)
#define    LDFEIM          1       /* LF Data FIFO Error Interrupt Mask */
#define    BM_LDFEIM	(uint8_t)(1U<<LDFEIM)

/* LDFRP - LF Data FIFO Read Pointer */
#define    LDFRP0          0       /* LF Data FIFO Read Pointer bit 0 */
#define    BM_LDFRP0	(uint8_t)(1U<<LDFRP0)
#define    LDFRP1          1       /* LF Data FIFO Read Pointer bit 1 */
#define    BM_LDFRP1	(uint8_t)(1U<<LDFRP1)
#define    LDFRP2          2       /* LF Data FIFO Read Pointer bit 2 */
#define    BM_LDFRP2	(uint8_t)(1U<<LDFRP2)
#define    LDFRP3          3       /* LF Data FIFO Read Pointer bit 3 */
#define    BM_LDFRP3	(uint8_t)(1U<<LDFRP3)
#define    LDFRP4          4       /* LF Data FIFO Read Pointer bit 4 */
#define    BM_LDFRP4	(uint8_t)(1U<<LDFRP4)
#define    LDFRP5          5       /* PH FIFO Read Pointer bit 5 */
#define    BM_LDFRP5	(uint8_t)(1U<<LDFRP5)

