camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* PHIDFR - Protocol Handler ID Frame Register */
#define    RDFS0           0       /*  */
#define    BM_RDFS0	(uint8_t)(1U<<RDFS0)
#define    RDFS1           1       /*  */
#define    BM_RDFS1	(uint8_t)(1U<<RDFS1)
#define    RDFS2           2       /*  */
#define    BM_RDFS2	(uint8_t)(1U<<RDFS2)
#define    RDFS3           3       /*  */
#define    BM_RDFS3	(uint8_t)(1U<<RDFS3)
#define    RDFS4           4       /*  */
#define    BM_RDFS4	(uint8_t)(1U<<RDFS4)
#define    RDFS5           5       /*  */
#define    BM_RDFS5	(uint8_t)(1U<<RDFS5)
#define    RDFS6           6       /*  */
#define    BM_RDFS6	(uint8_t)(1U<<RDFS6)
#define    RDFS7           7       /*  */
#define    BM_RDFS7	(uint8_t)(1U<<RDFS7)

/* PHIMR - Protocol Handler Interrupt Mask Register */
#define    PHTBLIM         1       /* Protocol Handler Telegram Bit Length Interrupt Mask */
#define    BM_PHTBLIM	(uint8_t)(1U<<PHTBLIM)
#define    PHDFIM          2       /* Protocol Handler Date Frame Interrupt Mask */
#define    BM_PHDFIM	(uint8_t)(1U<<PHDFIM)
#define    PHIDFIM         3       /* Protocol Handler ID Frame Interrupt Mask */
#define    BM_PHIDFIM	(uint8_t)(1U<<PHIDFIM)
#define    PHID0IM         4       /* Protocol Handler IDentifier 0 Interrupt Mask */
#define    BM_PHID0IM	(uint8_t)(1U<<PHID0IM)
#define    PHID1IM         5       /* Protocol Handler IDentifier 1 Interrupt Mask */
#define    BM_PHID1IM	(uint8_t)(1U<<PHID1IM)

/* PHTBLR - Protocol Handler Telegram Bit Length Register */
#define    PHTBL0          0       /*  */
#define    BM_PHTBL0	(uint8_t)(1U<<PHTBL0)
#define    PHTBL1          1       /*  */
#define    BM_PHTBL1	(uint8_t)(1U<<PHTBL1)
#define    PHTBL2          2       /*  */
#define    BM_PHTBL2	(uint8_t)(1U<<PHTBL2)
#define    PHTBL3          3       /*  */
#define    BM_PHTBL3	(uint8_t)(1U<<PHTBL3)
#define    PHTBL4          4       /*  */
#define    BM_PHTBL4	(uint8_t)(1U<<PHTBL4)
#define    PHTBL5          5       /*  */
#define    BM_PHTBL5	(uint8_t)(1U<<PHTBL5)
#define    PHTBL6          6       /*  */
#define    BM_PHTBL6	(uint8_t)(1U<<PHTBL6)
#define    PHTBL7          7       /*  */
#define    BM_PHTBL7	(uint8_t)(1U<<PHTBL7)

/* PHTCR - PH Telegram Configuration Register */
#define    FRFIFO          5       /* ID Frame stored in FIFO */
#define    BM_FRFIFO	(uint8_t)(1U<<FRFIFO)
#define    CPM             6       /* Continuous Pattern Mode */
#define    BM_CPM	(uint8_t)(1U<<CPM)
#define    CSM             7       /* Continue or Single receive Mode */
#define    BM_CSM	(uint8_t)(1U<<CSM)


/* ***** LF_RECEIVER ****************** */
/* LFCR0 - LF Receiver Control Register 0 */
#define    LFCE1           0       /* LF Receiver Channel 1 Enable */
#define    BM_LFCE1	(uint8_t)(1U<<LFCE1)
#define    LFCE2           1       /* LF Receiver Channel 2 Enable */
#define    BM_LFCE2	(uint8_t)(1U<<LFCE2)
#define    LFCE3           2       /* LF Receiver Channel 3 Enable */
#define    BM_LFCE3	(uint8_t)(1U<<LFCE3)
#define    LFBR0           3       /* LF Receiver Bit Rate bit 0 */
#define    BM_LFBR0	(uint8_t)(1U<<LFBR0)
#define    LFBR1           4       /* LF Receiver Bit Rate bit 1 */
#define    BM_LFBR1	(uint8_t)(1U<<LFBR1)
#define    LFMG            5       /* LF Receiver Maximum Gain Select */
#define    BM_LFMG	(uint8_t)(1U<<LFMG)
#define    LFRRT0          6       /* LF Receiver Reset Time select bit 0 */
#define    BM_LFRRT0	(uint8_t)(1U<<LFRRT0)
#define    LFRRT1          7       /* LF Receiver Reset Time select bit 1 */
#define    BM_LFRRT1	(uint8_t)(1U<<LFRRT1)

/* LFCR1 - LF Receiver Control Register 1 */
#define    RSST0           0       /* RSSI Startup TIme bit 0 */
#define    BM_RSST0	(uint8_t)(1U<<RSST0)
#define    RSST1           1       /* RSSI Startup TIme bit 1 */
#define    BM_RSST1	(uint8_t)(1U<<RSST1)
#define    LFFM1           2       /* LF Function Mode bit 1 */
#define    BM_LFFM1	(uint8_t)(1U<<LFFM1)
#define    ARMDE           3       /* Analog Reset Manchester Detector Enable */
#define    BM_ARMDE	(uint8_t)(1U<<ARMDE)
#define    FLLEN           4       /* FLL Enable */
#define    BM_FLLEN	(uint8_t)(1U<<FLLEN)
#define    ADTHEN          5       /* Adapt Threshold Enable */
#define    BM_ADTHEN	(uint8_t)(1U<<ADTHEN)
#define    LFPEEN          6       /* LF Port Event Enable */
#define    BM_LFPEEN	(uint8_t)(1U<<LFPEEN)
#define    LFRE            7       /* LF Receiver Enable */
#define    BM_LFRE	(uint8_t)(1U<<LFRE)

/* LFCR2 - LF Receiver Control Register 2 */
#define    LFSEN0          0       /* LF Sensitivity Mode bit 0 */
#define    BM_LFSEN0	(uint8_t)(1U<<LFSEN0)
#define    LFSEN1          1       /* LF Sensitivity Mode bit 1 */
#define    BM_LFSEN1	(uint8_t)(1U<<LFSEN1)
#define    LFDAMP          2       /* LF coil Damping level select */
#define    BM_LFDAMP	(uint8_t)(1U<<LFDAMP)
#define    LFVC0           5       /* LF Velocity Control bit 0 */
#define    BM_LFVC0	(uint8_t)(1U<<LFVC0)
#define    LFVC1           6       /* LF Velocity Control bit 1 */
#define    BM_LFVC1	(uint8_t)(1U<<LFVC1)
#define    LFVC2           7       /* LF Velocity Control bit 2 */
#define    BM_LFVC2	(uint8_t)(1U<<LFVC2)

/* LFCR3 - LF Receiver Control Register 3 */
#define    LFRCTEN         0       /* LF RC Trim Enable */
#define    BM_LFRCTEN	(uint8_t)(1U<<LFRCTEN)
#define    LFRCPCEN        1       /* LF RC Pump Continuous Enable */
#define    BM_LFRCPCEN	(uint8_t)(1U<<LFRCPCEN)
#define    LFRCPM          2       /* LF RC Pump mode Enable */
#define    BM_LFRCPM	(uint8_t)(1U<<LFRCPM)
#define    LFTON           3       /* LF On Time with Activated Standby Mode */
#define    BM_LFTON	(uint8_t)(1U<<LFTON)
#define    LFTS0           4       /* LF Standby Time */
#define    BM_LFTS0	(uint8_t)(1U<<LFTS0)
#define    LFTS1           5       /* LF Standby Time */
#define    BM_LFTS1	(uint8_t)(1U<<LFTS1)
#define    LFTS2           6       /* LF Standby Time */
#define    BM_LFTS2	(uint8_t)(1U<<LFTS2)
#define    LFSBEN          7       /* LF Standby mode Enable */
#define    BM_LFSBEN	(uint8_t)(1U<<LFSBEN)

/* LFDSR1 - LF Receiver Decoder Setting Register 1 */
#define    LOTHA0          0       /* Low Threshold A bit 0 */
#define    BM_LOTHA0	(uint8_t)(1U<<LOTHA0)
#define    LOTHA1          1       /* Low Threshold A bit 1 */
#define    BM_LOTHA1	(uint8_t)(1U<<LOTHA1)
#define    HITHA0          2       /* High Threshold A bit 0 */
#define    BM_HITHA0	(uint8_t)(1U<<HITHA0)
#define    HITHA1          3       /* High Threshold A bit 1 */
#define    BM_HITHA1	(uint8_t)(1U<<HITHA1)
#define    CTTHA0          4       /* Count Threshold A bit 0 */
#define    BM_CTTHA0	(uint8_t)(1U<<CTTHA0)
#define    CTTHA1          5       /* Count Threshold A bit 1 */
#define    BM_CTTHA1	(uint8_t)(1U<<CTTHA1)

/* LFDSR11 - Low Frequency Decoder Setting Register 11 */
#define    TINITA0         0       /* Time Init A bit 0 */
#define    BM_TINITA0	(uint8_t)(1U<<TINITA0)
#define    TINITA1         1       /* Time Init A bit 1 */
#define    BM_TINITA1	(uint8_t)(1U<<TINITA1)
#define    TINITA2         2       /* Time Init A bit 2 */
#define    BM_TINITA2	(uint8_t)(1U<<TINITA2)
#define    TINITA3         3       /* Time Init A bit 3 */
#define    BM_TINITA3	(uint8_t)(1U<<TINITA3)
#define    TINITB0         4       /* Time Init B bit 0 */
#define    BM_TINITB0	(uint8_t)(1U<<TINITB0)
#define    TINITB1         5       /* Time Init B bit 1 */
#define    BM_TINITB1	(uint8_t)(1U<<TINITB1)
#define    TINITB2         6       /* Time Init B bit 2 */
#define    BM_TINITB2	(uint8_t)(1U<<TINITB2)
#define    TINITB3         7       /* Time Init B bit 3 */
#define    BM_TINITB3	(uint8_t)(1U<<TINITB3)

/* LFDSR2 - LF Receiver Decoder Setting Register 2 */
#define    LOTHB0          0       /* Low Threshold B bit 0 */
#define    BM_LOTHB0	(uint8_t)(1U<<LOTHB0)
#define    LOTHB1          1       /* Low Threshold B bit 1 */
#define    BM_LOTHB1	(uint8_t)(1U<<LOTHB1)
#define    HITHB0          2       /* High Threshold B bit 0 */
#define    BM_HITHB0	(uint8_t)(1U<<HITHB0)
#define    HITHB1          3       /* High Threshold B bit 1 */
#define    BM_HITHB1	(uint8_t)(1U<<HITHB1)
#define    CTTHB0          4       /* Count Threshold B bit 0 */
#define    BM_CTTHB0	(uint8_t)(1U<<CTTHB0)
#define    CTTHB1          5       /* Count Threshold B bit 1 */
#define    BM_CTTHB1	(uint8_t)(1U<<CTTHB1)

