camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* LFDSR3 - LF Receiver Decoder Setting Register 3 */
#define    PBDTH0          0       /* Preburst Detection Threshold bit 0 */
#define    BM_PBDTH0	(uint8_t)(1U<<PBDTH0)
#define    PBDTH1          1       /* Preburst Detection Threshold bit 1 */
#define    BM_PBDTH1	(uint8_t)(1U<<PBDTH1)
#define    QCTH0           3       /* Quality Check Threshold bit 0 */
#define    BM_QCTH0	(uint8_t)(1U<<QCTH0)
#define    QCTH1           4       /* Quality Check Threshold bit 1 */
#define    BM_QCTH1	(uint8_t)(1U<<QCTH1)
#define    QCTH2           5       /* Quality Check Threshold bit 2 */
#define    BM_QCTH2	(uint8_t)(1U<<QCTH2)

/* LFDSR4 - LF Receiver Decoder Setting Register 4 */
#define    SDTHA0          0       /* Sync Detection Threshold A bit 0 */
#define    BM_SDTHA0	(uint8_t)(1U<<SDTHA0)
#define    SDTHA1          1       /* Sync Detection Threshold A bit 1 */
#define    BM_SDTHA1	(uint8_t)(1U<<SDTHA1)
#define    SDTHA2          2       /* Sync Detection Threshold A bit 2 */
#define    BM_SDTHA2	(uint8_t)(1U<<SDTHA2)
#define    SCTHA0          3       /* Sync Count Threshold A bit 0 */
#define    BM_SCTHA0	(uint8_t)(1U<<SCTHA0)
#define    SCTHA1          4       /* Sync Count Threshold A bit 1 */
#define    BM_SCTHA1	(uint8_t)(1U<<SCTHA1)
#define    SCTHA2          5       /* Sync Count Threshold A bit 2 */
#define    BM_SCTHA2	(uint8_t)(1U<<SCTHA2)
#define    SRSTC0          6       /* Sync Restart Control bit 0 */
#define    BM_SRSTC0	(uint8_t)(1U<<SRSTC0)
#define    SRSTC1          7       /* Sync Restart Control bit 1 */
#define    BM_SRSTC1	(uint8_t)(1U<<SRSTC1)

/* LFFR - LF Receiver Flag Register */
#define    LFSYDF          0       /* LF Synchronization Detect Flag */
#define    BM_LFSYDF	(uint8_t)(1U<<LFSYDF)
#define    LFDEF           1       /* LF Decoder Error Flag */
#define    BM_LFDEF	(uint8_t)(1U<<LFDEF)
#define    LFEOF           2       /* LF End of Telegram Flag */
#define    BM_LFEOF	(uint8_t)(1U<<LFEOF)
#define    LFTOF           3       /* LF telegram Time Out Flag */
#define    BM_LFTOF	(uint8_t)(1U<<LFTOF)
#define    LFSD            6       /* LF Signal Detect */
#define    BM_LFSD	(uint8_t)(1U<<LFSD)
#define    LFES            7       /* LF Envelope Signal */
#define    BM_LFES	(uint8_t)(1U<<LFES)

/* LFIMR - LF Receiver Interrupt Mask Register */
#define    LFSYDIM         0       /* LF Synchronization Detected Interrupt Mask */
#define    BM_LFSYDIM	(uint8_t)(1U<<LFSYDIM)
#define    LFDEIM          1       /* LF Decoder Error Interrupt Mask */
#define    BM_LFDEIM	(uint8_t)(1U<<LFDEIM)
#define    LFEOIM          2       /* LF End Of telegram Interrupt Mask */
#define    BM_LFEOIM	(uint8_t)(1U<<LFEOIM)

/* LFQC1 - LF Receiver Channel 1 Quality Faktor Register */
#define    LFQS10          0       /* LF resistor select channel 1 bit 0 */
#define    BM_LFQS10	(uint8_t)(1U<<LFQS10)
#define    LFQS11          1       /* LF resistor select channel 1 bit 1 */
#define    BM_LFQS11	(uint8_t)(1U<<LFQS11)
#define    LFQS12          2       /* LF resistor select channel 1 bit 2 */
#define    BM_LFQS12	(uint8_t)(1U<<LFQS12)
#define    LFQS13          3       /* LF resistor select channel 1 bit 3 */
#define    BM_LFQS13	(uint8_t)(1U<<LFQS13)
#define    LFCS10          4       /* LF capacitor select channel 1 bit 0 */
#define    BM_LFCS10	(uint8_t)(1U<<LFCS10)
#define    LFCS11          5       /* LF capacitor select channel 1 bit 1 */
#define    BM_LFCS11	(uint8_t)(1U<<LFCS11)
#define    LFCS12          6       /* LF capacitor select channel 1 bit 2 */
#define    BM_LFCS12	(uint8_t)(1U<<LFCS12)
#define    LFCS13          7       /* LF capacitor select channel 1 bit 3 */
#define    BM_LFCS13	(uint8_t)(1U<<LFCS13)

/* LFQC2 - LF Receiver Channel 2 Quality Faktor Register */
#define    LFQS20          0       /* LF resistor select channel 2 bit 0 */
#define    BM_LFQS20	(uint8_t)(1U<<LFQS20)
#define    LFQS21          1       /* LF resistor select channel 2 bit 1 */
#define    BM_LFQS21	(uint8_t)(1U<<LFQS21)
#define    LFQS22          2       /* LF resistor select channel 2 bit 2 */
#define    BM_LFQS22	(uint8_t)(1U<<LFQS22)
#define    LFQS23          3       /* LF resistor select channel 2 bit 3 */
#define    BM_LFQS23	(uint8_t)(1U<<LFQS23)
#define    LFCS20          4       /* LF capacitor select channel 2 bit 0 */
#define    BM_LFCS20	(uint8_t)(1U<<LFCS20)
#define    LFCS21          5       /* LF capacitor select channel 2 bit 1 */
#define    BM_LFCS21	(uint8_t)(1U<<LFCS21)
#define    LFCS22          6       /* LF capacitor select channel 2 bit 2 */
#define    BM_LFCS22	(uint8_t)(1U<<LFCS22)
#define    LFCS23          7       /* LF capacitor select channel 2 bit 3 */
#define    BM_LFCS23	(uint8_t)(1U<<LFCS23)

/* LFQC3 - LF Receiver Channel 3 Quality Faktor Register */
#define    LFQS30          0       /* LF resistor select channel 3 bit 0 */
#define    BM_LFQS30	(uint8_t)(1U<<LFQS30)
#define    LFQS31          1       /* LF resistor select channel 3 bit 1 */
#define    BM_LFQS31	(uint8_t)(1U<<LFQS31)
#define    LFQS32          2       /* LF resistor select channel 3 bit 2 */
#define    BM_LFQS32	(uint8_t)(1U<<LFQS32)
#define    LFQS33          3       /* LF resistor select channel 3 bit 3 */
#define    BM_LFQS33	(uint8_t)(1U<<LFQS33)
#define    LFCS30          4       /* LF capacitor select channel 3 bit 0 */
#define    BM_LFCS30	(uint8_t)(1U<<LFCS30)
#define    LFCS31          5       /* LF capacitor select channel 3 bit 1 */
#define    BM_LFCS31	(uint8_t)(1U<<LFCS31)
#define    LFCS32          6       /* LF capacitor select channel 3 bit 2 */
#define    BM_LFCS32	(uint8_t)(1U<<LFCS32)
#define    LFCS33          7       /* LF capacitor select channel 3 bit 3 */
#define    BM_LFCS33	(uint8_t)(1U<<LFCS33)

/* LFSTOP - LF Receiver Stop Bit Register */
#define    LFSTSY0         0       /* LF Stop Bits Symbols bit 0 */
#define    BM_LFSTSY0	(uint8_t)(1U<<LFSTSY0)
#define    LFSTSY1         1       /* LF Stop Bits Symbols bit 1 */
#define    BM_LFSTSY1	(uint8_t)(1U<<LFSTSY1)
#define    LFSTSY2         2       /* LF Stop Bits Symbols bit 2 */
#define    BM_LFSTSY2	(uint8_t)(1U<<LFSTSY2)
#define    LFSTSY3         3       /* LF Stop Bits Symbols bit 3 */
#define    BM_LFSTSY3	(uint8_t)(1U<<LFSTSY3)
#define    LFSTL0          4       /* LF Stop Bits Length bit 0 */
#define    BM_LFSTL0	(uint8_t)(1U<<LFSTL0)
#define    LFSTL1          5       /* LF Stop Bits Length bit 1 */
#define    BM_LFSTL1	(uint8_t)(1U<<LFSTL1)
#define    LFSTL2          6       /* LF Stop Bits Length bit 2 */
#define    BM_LFSTL2	(uint8_t)(1U<<LFSTL2)

