camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* LFSYLE - LF Receiver Synchronization Length Register */
#define    LFSYLE0         0       /*  */
#define    BM_LFSYLE0	(uint8_t)(1U<<LFSYLE0)
#define    LFSYLE1         1       /*  */
#define    BM_LFSYLE1	(uint8_t)(1U<<LFSYLE1)
#define    LFSYLE2         2       /*  */
#define    BM_LFSYLE2	(uint8_t)(1U<<LFSYLE2)
#define    LFSYLE3         3       /*  */
#define    BM_LFSYLE3	(uint8_t)(1U<<LFSYLE3)
#define    LFSYLE4         4       /*  */
#define    BM_LFSYLE4	(uint8_t)(1U<<LFSYLE4)
#define    LFSYLE5         5       /*  */
#define    BM_LFSYLE5	(uint8_t)(1U<<LFSYLE5)


/* ***** LF_RSSI ********************** */
/* RSCALIB - RSSI Calibration Register */
#define    RSCALIB0        0       /* RSSI Calibration Bit 0 */
#define    BM_RSCALIB0	(uint8_t)(1U<<RSCALIB0)
#define    RSCALIB1        1       /* RSSI Calibration Bit 1 */
#define    BM_RSCALIB1	(uint8_t)(1U<<RSCALIB1)
#define    RSCALIB2        2       /* RSSI Calibration Bit 2 */
#define    BM_RSCALIB2	(uint8_t)(1U<<RSCALIB2)
#define    RSCALIB3        3       /* RSSI Calibration Bit 3 */
#define    BM_RSCALIB3	(uint8_t)(1U<<RSCALIB3)
#define    RSCALIB4        4       /* RSSI Calibration Bit 4 */
#define    BM_RSCALIB4	(uint8_t)(1U<<RSCALIB4)
#define    RSCALIB5        5       /* RSSI Calibration Bit 5 */
#define    BM_RSCALIB5	(uint8_t)(1U<<RSCALIB5)
#define    RSCALIB6        6       /* RSSI Calibration Bit 6 */
#define    BM_RSCALIB6	(uint8_t)(1U<<RSCALIB6)
#define    RSCALIB7        7       /* RSSI Calibration Bit 7 */
#define    BM_RSCALIB7	(uint8_t)(1U<<RSCALIB7)

/* RSCR - RSSI Control Register */
#define    RSSDEN          0       /* RSSI Sign Detection Enable Bit */
#define    BM_RSSDEN	(uint8_t)(1U<<RSSDEN)
#define    RSOS            1       /* RSSI Operation Start Bit */
#define    BM_RSOS	(uint8_t)(1U<<RSOS)
#define    RSEOR           2       /* RSSI End Operation Request Bit */
#define    BM_RSEOR	(uint8_t)(1U<<RSEOR)
#define    RSOFM           3       /* RSSI Operation Flag Mask Bit */
#define    BM_RSOFM	(uint8_t)(1U<<RSOFM)
#define    RSMODE0         4       /* RSSI Mode Bit 0 */
#define    BM_RSMODE0	(uint8_t)(1U<<RSMODE0)
#define    RSMODE1         5       /* RSSI Mode Bit 1 */
#define    BM_RSMODE1	(uint8_t)(1U<<RSMODE1)
#define    RSRES           7       /* RSSI Reset Bit */
#define    BM_RSRES	(uint8_t)(1U<<RSRES)

/* RSDBGR - RSSI Debug Register */
#define    RSSANA          0       /* RSSI Set Analog Bit */
#define    BM_RSSANA	(uint8_t)(1U<<RSSANA)
#define    RSINFM          2       /* RSSI Infinity Measurement Bit */
#define    BM_RSINFM	(uint8_t)(1U<<RSINFM)
#define    RSFPD           3       /* RSSI Fix Pre-Divider Bit */
#define    BM_RSFPD	(uint8_t)(1U<<RSFPD)
#define    RSHOME          4       /* RSSI Hold Measurement Bit */
#define    BM_RSHOME	(uint8_t)(1U<<RSHOME)
#define    RSDBGS0         5       /* RSSI Debug Select Bit 0 */
#define    BM_RSDBGS0	(uint8_t)(1U<<RSDBGS0)
#define    RSDBGS1         6       /* RSSI Debug Select Bit 1 */
#define    BM_RSDBGS1	(uint8_t)(1U<<RSDBGS1)
#define    RSDBGEN         7       /* RSSI Debug Enable Bit */
#define    BM_RSDBGEN	(uint8_t)(1U<<RSDBGEN)

/* RSDLYR - RSSI Delay Register */
#define    RSTRD0          0       /* RSSI Tracking Delay Bit 0 */
#define    BM_RSTRD0	(uint8_t)(1U<<RSTRD0)
#define    RSTRD1          1       /* RSSI Tracking Delay Bit 1 */
#define    BM_RSTRD1	(uint8_t)(1U<<RSTRD1)
#define    RSTRD2          2       /* RSSI Tracking Delay Bit 2 */
#define    BM_RSTRD2	(uint8_t)(1U<<RSTRD2)
#define    RSTRD3          3       /* RSSI Tracking Delay Bit 3 */
#define    BM_RSTRD3	(uint8_t)(1U<<RSTRD3)
#define    RSTRD4          4       /* RSSI Tracking Delay Bit 4 */
#define    BM_RSTRD4	(uint8_t)(1U<<RSTRD4)
#define    RSTRD5          5       /* RSSI Tracking Delay Bit 5 */
#define    BM_RSTRD5	(uint8_t)(1U<<RSTRD5)
#define    RSRD0           6       /* RSSI Range Delay Bit 0 */
#define    BM_RSRD0	(uint8_t)(1U<<RSRD0)
#define    RSRD1           7       /* RSSI Range Delay Bit 1 */
#define    BM_RSRD1	(uint8_t)(1U<<RSRD1)

/* RSFR - RSSI Flag Register */
#define    RSOOR1          0       /* RSSI Out of Range Channel 1 Bit */
#define    BM_RSOOR1	(uint8_t)(1U<<RSOOR1)
#define    RSOOR2          1       /* RSSI Out of Range Channel 2 Bit */
#define    BM_RSOOR2	(uint8_t)(1U<<RSOOR2)
#define    RSOOR3          2       /* RSSI Out of Range Channel 3 Bit */
#define    BM_RSOOR3	(uint8_t)(1U<<RSOOR3)
#define    RSOFF           3       /* RSSI Operation Finish Flag Bit */
#define    BM_RSOFF	(uint8_t)(1U<<RSOFF)
#define    RSAOOR1         5       /* RSSI Averaging Out of Range Channel 1 Bit */
#define    BM_RSAOOR1	(uint8_t)(1U<<RSAOOR1)
#define    RSAOOR2         6       /* RSSI Averaging Out of Range Channel 2 Bit */
#define    BM_RSAOOR2	(uint8_t)(1U<<RSAOOR2)
#define    RSAOOR3         7       /* RSSI Averaging Out of Range Channel 3 Bit */
#define    BM_RSAOOR3	(uint8_t)(1U<<RSAOOR3)

/* RSMS1R - RSSI Measurement Setting 1 Register */
#define    RSCH1E          0       /* RSSI Channel 1 Enable Bit */
#define    BM_RSCH1E	(uint8_t)(1U<<RSCH1E)
#define    RSCH2E          1       /* RSSI Channel 2 Enable Bit */
#define    BM_RSCH2E	(uint8_t)(1U<<RSCH2E)
#define    RSCH3E          2       /* RSSI Channel 3 Enable Bit */
#define    BM_RSCH3E	(uint8_t)(1U<<RSCH3E)
#define    RSINTM          3       /* RSSI internal Measurement Bit */
#define    BM_RSINTM	(uint8_t)(1U<<RSINTM)
#define    RSSTIM          4       /* RSSI Stimulus Bit */
#define    BM_RSSTIM	(uint8_t)(1U<<RSSTIM)
#define    RSCMS           5       /* RSSI Current Mode Select Bit */
#define    BM_RSCMS	(uint8_t)(1U<<RSCMS)
#define    RSSSV           6       /* RSSI Show Sample Value Bit */
#define    BM_RSSSV	(uint8_t)(1U<<RSSSV)
#define    RSSCAL          7       /* RSSI Set Calibration Bit */
#define    BM_RSSCAL	(uint8_t)(1U<<RSSCAL)

/* RSMS2R - RSSI Measurement Setting 2 Register */
#define    RSSADR0         0       /* RSSI Sample Address Bit 0 */
#define    BM_RSSADR0	(uint8_t)(1U<<RSSADR0)
#define    RSSADR1         1       /* RSSI Sample Address Bit 1 */
#define    BM_RSSADR1	(uint8_t)(1U<<RSSADR1)
#define    RSSADR2         2       /* RSSI Sample Address Bit 2 */
#define    BM_RSSADR2	(uint8_t)(1U<<RSSADR2)
#define    RSSADR3         3       /* RSSI Sample Address Bit 3 */
#define    BM_RSSADR3	(uint8_t)(1U<<RSSADR3)
#define    RSAVGS0         4       /* RSSI Average Select Bit 0 */
#define    BM_RSAVGS0	(uint8_t)(1U<<RSAVGS0)
#define    RSAVGS1         5       /* RSSI Average Select Bit 1 */
#define    BM_RSAVGS1	(uint8_t)(1U<<RSAVGS1)
#define    RSAVGS2         6       /* RSSI Average Select Bit 2 */
#define    BM_RSAVGS2	(uint8_t)(1U<<RSAVGS2)
#define    RSAVGS3         7       /* RSSI Average Select Bit 3 */
#define    BM_RSAVGS3	(uint8_t)(1U<<RSAVGS3)

/* RSRES1H - RSSI Result 1 High Byte Register */
#define    RSRES1H0        0       /* RSSI Result 1 High Byte Bit 0 */
#define    BM_RSRES1H0	(uint8_t)(1U<<RSRES1H0)
#define    RSRES1H1        1       /* RSSI Result 1 High Byte Bit 1 */
#define    BM_RSRES1H1	(uint8_t)(1U<<RSRES1H1)
#define    RSRES1H2        2       /* RSSI Result 1 High Byte Bit 2 */
#define    BM_RSRES1H2	(uint8_t)(1U<<RSRES1H2)
#define    RSRES1H3        3       /* RSSI Result 1 High Byte Bit 3 */
#define    BM_RSRES1H3	(uint8_t)(1U<<RSRES1H3)
#define    RSRES1H4        4       /* RSSI Result 1 High Byte Bit 4 */
#define    BM_RSRES1H4	(uint8_t)(1U<<RSRES1H4)
#define    RSRES1H5        5       /* RSSI Result 1 High Byte Bit 5 */
#define    BM_RSRES1H5	(uint8_t)(1U<<RSRES1H5)
#define    RSRES1H6        6       /* RSSI Result 1 High Byte Bit 6 */
#define    BM_RSRES1H6	(uint8_t)(1U<<RSRES1H6)
#define    RSRES1H7        7       /* RSSI Result 1 High Byte Bit 7 */
#define    BM_RSRES1H7	(uint8_t)(1U<<RSRES1H7)

