camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* RSRES1L - RSSI Result 1 Low Byte Register */
#define    RSRES1L0        0       /* RSSI Result 1 Low Byte Bit 0 */
#define    BM_RSRES1L0	(uint8_t)(1U<<RSRES1L0)
#define    RSRES1L1        1       /* RSSI Result 1 Low Byte Bit 1 */
#define    BM_RSRES1L1	(uint8_t)(1U<<RSRES1L1)
#define    RSRES1L2        2       /* RSSI Result 1 Low Byte Bit 2 */
#define    BM_RSRES1L2	(uint8_t)(1U<<RSRES1L2)
#define    RSRES1L3        3       /* RSSI Result 1 Low Byte Bit 3 */
#define    BM_RSRES1L3	(uint8_t)(1U<<RSRES1L3)
#define    RSRES1L4        4       /* RSSI Result 1 Low Byte Bit 4 */
#define    BM_RSRES1L4	(uint8_t)(1U<<RSRES1L4)
#define    RSRES1L5        5       /* RSSI Result 1 Low Byte Bit 5 */
#define    BM_RSRES1L5	(uint8_t)(1U<<RSRES1L5)
#define    RSRES1L6        6       /* RSSI Result 1 Low Byte Bit 6 */
#define    BM_RSRES1L6	(uint8_t)(1U<<RSRES1L6)
#define    RSRES1L7        7       /* RSSI Result 1 Low Byte Bit 7 */
#define    BM_RSRES1L7	(uint8_t)(1U<<RSRES1L7)

/* RSRES2H - RSSI Result 2 High Byte Register */
#define    RSRES2H0        0       /* RSSI Result 2 High Byte Bit 0 */
#define    BM_RSRES2H0	(uint8_t)(1U<<RSRES2H0)
#define    RSRES2H1        1       /* RSSI Result 2 High Byte Bit 1 */
#define    BM_RSRES2H1	(uint8_t)(1U<<RSRES2H1)
#define    RSRES2H2        2       /* RSSI Result 2 High Byte Bit 2 */
#define    BM_RSRES2H2	(uint8_t)(1U<<RSRES2H2)
#define    RSRES2H3        3       /* RSSI Result 2 High Byte Bit 3 */
#define    BM_RSRES2H3	(uint8_t)(1U<<RSRES2H3)
#define    RSRES2H4        4       /* RSSI Result 2 High Byte Bit 4 */
#define    BM_RSRES2H4	(uint8_t)(1U<<RSRES2H4)
#define    RSRES2H5        5       /* RSSI Result 2 High Byte Bit 5 */
#define    BM_RSRES2H5	(uint8_t)(1U<<RSRES2H5)
#define    RSRES2H6        6       /* RSSI Result 2 High Byte Bit 6 */
#define    BM_RSRES2H6	(uint8_t)(1U<<RSRES2H6)
#define    RSRES2H7        7       /* RSSI Result 2 High Byte Bit 7 */
#define    BM_RSRES2H7	(uint8_t)(1U<<RSRES2H7)

/* RSRES2L - RSSI Result 2 Low Byte Register */
#define    RSRES2L0        0       /* RSSI Result 2 Low Byte Bit 0 */
#define    BM_RSRES2L0	(uint8_t)(1U<<RSRES2L0)
#define    RSRES2L1        1       /* RSSI Result 2 Low Byte Bit 1 */
#define    BM_RSRES2L1	(uint8_t)(1U<<RSRES2L1)
#define    RSRES2L2        2       /* RSSI Result 2 Low Byte Bit 2 */
#define    BM_RSRES2L2	(uint8_t)(1U<<RSRES2L2)
#define    RSRES2L3        3       /* RSSI Result 2 Low Byte Bit 3 */
#define    BM_RSRES2L3	(uint8_t)(1U<<RSRES2L3)
#define    RSRES2L4        4       /* RSSI Result 2 Low Byte Bit 4 */
#define    BM_RSRES2L4	(uint8_t)(1U<<RSRES2L4)
#define    RSRES2L5        5       /* RSSI Result 2 Low Byte Bit 5 */
#define    BM_RSRES2L5	(uint8_t)(1U<<RSRES2L5)
#define    RSRES2L6        6       /* RSSI Result 2 Low Byte Bit 6 */
#define    BM_RSRES2L6	(uint8_t)(1U<<RSRES2L6)
#define    RSRES2L7        7       /* RSSI Result 2 Low Byte Bit 7 */
#define    BM_RSRES2L7	(uint8_t)(1U<<RSRES2L7)

/* RSRES3H - RSSI Result 3 High Byte Register */
#define    RSRES3H0        0       /* RSSI Result 3 High Byte Bit 0 */
#define    BM_RSRES3H0	(uint8_t)(1U<<RSRES3H0)
#define    RSRES3H1        1       /* RSSI Result 3 High Byte Bit 1 */
#define    BM_RSRES3H1	(uint8_t)(1U<<RSRES3H1)
#define    RSRES3H2        2       /* RSSI Result 3 High Byte Bit 2 */
#define    BM_RSRES3H2	(uint8_t)(1U<<RSRES3H2)
#define    RSRES3H3        3       /* RSSI Result 3 High Byte Bit 3 */
#define    BM_RSRES3H3	(uint8_t)(1U<<RSRES3H3)
#define    RSRES3H4        4       /* RSSI Result 3 High Byte Bit 4 */
#define    BM_RSRES3H4	(uint8_t)(1U<<RSRES3H4)
#define    RSRES3H5        5       /* RSSI Result 3 High Byte Bit 5 */
#define    BM_RSRES3H5	(uint8_t)(1U<<RSRES3H5)
#define    RSRES3H6        6       /* RSSI Result 3 High Byte Bit 6 */
#define    BM_RSRES3H6	(uint8_t)(1U<<RSRES3H6)
#define    RSRES3H7        7       /* RSSI Result 3 High Byte Bit 7 */
#define    BM_RSRES3H7	(uint8_t)(1U<<RSRES3H7)

/* RSRES3L - RSSI Result 3 Low Byte Register */
#define    RSRES3L0        0       /* RSSI Result 3 Low Byte Bit 0 */
#define    BM_RSRES3L0	(uint8_t)(1U<<RSRES3L0)
#define    RSRES3L1        1       /* RSSI Result 3 Low Byte Bit 1 */
#define    BM_RSRES3L1	(uint8_t)(1U<<RSRES3L1)
#define    RSRES3L2        2       /* RSSI Result 3 Low Byte Bit 2 */
#define    BM_RSRES3L2	(uint8_t)(1U<<RSRES3L2)
#define    RSRES3L3        3       /* RSSI Result 3 Low Byte Bit 3 */
#define    BM_RSRES3L3	(uint8_t)(1U<<RSRES3L3)
#define    RSRES3L4        4       /* RSSI Result 3 Low Byte Bit 4 */
#define    BM_RSRES3L4	(uint8_t)(1U<<RSRES3L4)
#define    RSRES3L5        5       /* RSSI Result 3 Low Byte Bit 5 */
#define    BM_RSRES3L5	(uint8_t)(1U<<RSRES3L5)
#define    RSRES3L6        6       /* RSSI Result 3 Low Byte Bit 6 */
#define    BM_RSRES3L6	(uint8_t)(1U<<RSRES3L6)
#define    RSRES3L7        7       /* RSSI Result 3 Low Byte Bit 7 */
#define    BM_RSRES3L7	(uint8_t)(1U<<RSRES3L7)

/* RSRES4H - RSSI Result 4 High Byte Register */
#define    RSRES4H0        0       /* RSSI Result 4 High Byte Bit 0 */
#define    BM_RSRES4H0	(uint8_t)(1U<<RSRES4H0)
#define    RSRES4H1        1       /* RSSI Result 4 High Byte Bit 1 */
#define    BM_RSRES4H1	(uint8_t)(1U<<RSRES4H1)
#define    RSRES4H2        2       /* RSSI Result 4 High Byte Bit 2 */
#define    BM_RSRES4H2	(uint8_t)(1U<<RSRES4H2)
#define    RSRES4H3        3       /* RSSI Result 4 High Byte Bit 3 */
#define    BM_RSRES4H3	(uint8_t)(1U<<RSRES4H3)
#define    RSRES4H4        4       /* RSSI Result 4 High Byte Bit 4 */
#define    BM_RSRES4H4	(uint8_t)(1U<<RSRES4H4)
#define    RSRES4H5        5       /* RSSI Result 4 High Byte Bit 5 */
#define    BM_RSRES4H5	(uint8_t)(1U<<RSRES4H5)
#define    RSRES4H6        6       /* RSSI Result 4 High Byte Bit 6 */
#define    BM_RSRES4H6	(uint8_t)(1U<<RSRES4H6)
#define    RSRES4H7        7       /* RSSI Result 4 High Byte Bit 7 */
#define    BM_RSRES4H7	(uint8_t)(1U<<RSRES4H7)

/* RSRES4L - RSSI Result 4 Low Byte Register */
#define    RSRES4L0        0       /* RSSI Result 4 Low Byte Bit 0 */
#define    BM_RSRES4L0	(uint8_t)(1U<<RSRES4L0)
#define    RSRES4L1        1       /* RSSI Result 4 Low Byte Bit 1 */
#define    BM_RSRES4L1	(uint8_t)(1U<<RSRES4L1)
#define    RSRES4L2        2       /* RSSI Result 4 Low Byte Bit 2 */
#define    BM_RSRES4L2	(uint8_t)(1U<<RSRES4L2)
#define    RSRES4L3        3       /* RSSI Result 4 Low Byte Bit 3 */
#define    BM_RSRES4L3	(uint8_t)(1U<<RSRES4L3)
#define    RSRES4L4        4       /* RSSI Result 4 Low Byte Bit 4 */
#define    BM_RSRES4L4	(uint8_t)(1U<<RSRES4L4)
#define    RSRES4L5        5       /* RSSI Result 4 Low Byte Bit 5 */
#define    BM_RSRES4L5	(uint8_t)(1U<<RSRES4L5)
#define    RSRES4L6        6       /* RSSI Result 4 Low Byte Bit 6 */
#define    BM_RSRES4L6	(uint8_t)(1U<<RSRES4L6)
#define    RSRES4L7        7       /* RSSI Result 4 Low Byte Bit 7 */
#define    BM_RSRES4L7	(uint8_t)(1U<<RSRES4L7)

/* RSSR - RSSI Status Register */
#define    RSRDY           0       /* RSSI Ready Bit */
#define    BM_RSRDY	(uint8_t)(1U<<RSRDY)
#define    RSSVLD          1       /* RSSI Sample Valid Bit */
#define    BM_RSSVLD	(uint8_t)(1U<<RSSVLD)

