camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* RSSRCR - RSSI SRC Calibration Register */
#define    SRCMODE0        0       /* RSSI SRC Calibration Mode Bit 0 */
#define    BM_SRCMODE0	(uint8_t)(1U<<SRCMODE0)
#define    SRCMODE1        1       /* RSSI SRC Calibration Mode Bit 1 */
#define    BM_SRCMODE1	(uint8_t)(1U<<SRCMODE1)
#define    SRCMIN0         2       /* RSSI SRC Minimum Value Bit 0 */
#define    BM_SRCMIN0	(uint8_t)(1U<<SRCMIN0)
#define    SRCMIN1         3       /* RSSI SRC Minimum Value Bit 1 */
#define    BM_SRCMIN1	(uint8_t)(1U<<SRCMIN1)
#define    SRCCLR          4       /* RSSI SRC Clear Bit */
#define    BM_SRCCLR	(uint8_t)(1U<<SRCCLR)
#define    SRCSTEP0        6       /* RSSI SRC Step Bit 0 */
#define    BM_SRCSTEP0	(uint8_t)(1U<<SRCSTEP0)
#define    SRCSTEP1        7       /* RSSI SRC Step Bit 1 */
#define    BM_SRCSTEP1	(uint8_t)(1U<<SRCSTEP1)

/* SD12RR - Sign Detection Channel 1 vs 2 Result Register */
#define    SD12RR0         0       /* Sign Detection Channel 1 vs 2 Result Bit 0 */
#define    BM_SD12RR0	(uint8_t)(1U<<SD12RR0)
#define    SD12RR1         1       /* Sign Detection Channel 1 vs 2 Result Bit 1 */
#define    BM_SD12RR1	(uint8_t)(1U<<SD12RR1)
#define    SD12RR2         2       /* Sign Detection Channel 1 vs 2 Result Bit 2 */
#define    BM_SD12RR2	(uint8_t)(1U<<SD12RR2)
#define    SD12RR3         3       /* Sign Detection Channel 1 vs 2 Result Bit 3 */
#define    BM_SD12RR3	(uint8_t)(1U<<SD12RR3)
#define    SD12RR4         4       /* Sign Detection Channel 1 vs 2 Result Bit 4 */
#define    BM_SD12RR4	(uint8_t)(1U<<SD12RR4)
#define    SD12RR5         5       /* Sign Detection Channel 1 vs 2 Result Bit 5 */
#define    BM_SD12RR5	(uint8_t)(1U<<SD12RR5)
#define    SD12RR6         6       /* Sign Detection Channel 1 vs 2 Result Bit 6 */
#define    BM_SD12RR6	(uint8_t)(1U<<SD12RR6)
#define    SD12RR7         7       /* Sign Detection Channel 1 vs 2 Result Bit 7 */
#define    BM_SD12RR7	(uint8_t)(1U<<SD12RR7)

/* SD13RR - Sign Detection Channel 1 vs 3 Result Register */
#define    SD13RR0         0       /* Sign Detection Channel 1 vs 3 Result Bit 0 */
#define    BM_SD13RR0	(uint8_t)(1U<<SD13RR0)
#define    SD13RR1         1       /* Sign Detection Channel 1 vs 3 Result Bit 1 */
#define    BM_SD13RR1	(uint8_t)(1U<<SD13RR1)
#define    SD13RR2         2       /* Sign Detection Channel 1 vs 3 Result Bit 2 */
#define    BM_SD13RR2	(uint8_t)(1U<<SD13RR2)
#define    SD13RR3         3       /* Sign Detection Channel 1 vs 3 Result Bit 3 */
#define    BM_SD13RR3	(uint8_t)(1U<<SD13RR3)
#define    SD13RR4         4       /* Sign Detection Channel 1 vs 3 Result Bit 4 */
#define    BM_SD13RR4	(uint8_t)(1U<<SD13RR4)
#define    SD13RR5         5       /* Sign Detection Channel 1 vs 3 Result Bit 5 */
#define    BM_SD13RR5	(uint8_t)(1U<<SD13RR5)
#define    SD13RR6         6       /* Sign Detection Channel 1 vs 3 Result Bit 6 */
#define    BM_SD13RR6	(uint8_t)(1U<<SD13RR6)
#define    SD13RR7         7       /* Sign Detection Channel 1 vs 3 Result Bit 7 */
#define    BM_SD13RR7	(uint8_t)(1U<<SD13RR7)

/* SD23RR - Sign Detection Channel 2 vs 3 Result Register */
#define    SD23RR0         0       /* Sign Detection Channel 2 vs 3 Result Bit 0 */
#define    BM_SD23RR0	(uint8_t)(1U<<SD23RR0)
#define    SD23RR1         1       /* Sign Detection Channel 2 vs 3 Result Bit 1 */
#define    BM_SD23RR1	(uint8_t)(1U<<SD23RR1)
#define    SD23RR2         2       /* Sign Detection Channel 2 vs 3 Result Bit 2 */
#define    BM_SD23RR2	(uint8_t)(1U<<SD23RR2)
#define    SD23RR3         3       /* Sign Detection Channel 2 vs 3 Result Bit 3 */
#define    BM_SD23RR3	(uint8_t)(1U<<SD23RR3)
#define    SD23RR4         4       /* Sign Detection Channel 2 vs 3 Result Bit 4 */
#define    BM_SD23RR4	(uint8_t)(1U<<SD23RR4)
#define    SD23RR5         5       /* Sign Detection Channel 2 vs 3 Result Bit 5 */
#define    BM_SD23RR5	(uint8_t)(1U<<SD23RR5)
#define    SD23RR6         6       /* Sign Detection Channel 2 vs 3 Result Bit 6 */
#define    BM_SD23RR6	(uint8_t)(1U<<SD23RR6)
#define    SD23RR7         7       /* Sign Detection Channel 2 vs 3 Result Bit 7 */
#define    BM_SD23RR7	(uint8_t)(1U<<SD23RR7)

/* SD360R - Sign Detection 360 Degree Result Register */
#define    SD360R0         0       /* Sign Detection 360 Degree Result Bit 0 */
#define    BM_SD360R0	(uint8_t)(1U<<SD360R0)
#define    SD360R1         1       /* Sign Detection 360 Degree Result Bit 1 */
#define    BM_SD360R1	(uint8_t)(1U<<SD360R1)
#define    SD360R2         2       /* Sign Detection 360 Degree Result Bit 2 */
#define    BM_SD360R2	(uint8_t)(1U<<SD360R2)
#define    SD360R3         3       /* Sign Detection 360 Degree Result Bit 3 */
#define    BM_SD360R3	(uint8_t)(1U<<SD360R3)
#define    SD360R4         4       /* Sign Detection 360 Degree Result Bit 4 */
#define    BM_SD360R4	(uint8_t)(1U<<SD360R4)
#define    SD360R5         5       /* Sign Detection 360 Degree Result Bit 5 */
#define    BM_SD360R5	(uint8_t)(1U<<SD360R5)
#define    SD360R6         6       /* Sign Detection 360 Degree Result Bit 6 */
#define    BM_SD360R6	(uint8_t)(1U<<SD360R6)
#define    SD360R7         7       /* Sign Detection 360 Degree Result Bit 7 */
#define    BM_SD360R7	(uint8_t)(1U<<SD360R7)


/* ***** LF_TIMER ********************* */
/* LTCMR - LF Timer Control Mode Register */
#define    LTPS0           0       /* LF Timer Prescaler Select bit 0 */
#define    BM_LTPS0	(uint8_t)(1U<<LTPS0)
#define    LTPS1           1       /* LF Timer Prescaler Select bit 1 */
#define    BM_LTPS1	(uint8_t)(1U<<LTPS1)
#define    LTPS2           2       /* LF Timer Prescaler Select bit 2 */
#define    BM_LTPS2	(uint8_t)(1U<<LTPS2)
#define    LTCRM           3       /* LF Timer Compare Reset Mask */
#define    BM_LTCRM	(uint8_t)(1U<<LTCRM)
#define    LTCIM           4       /* LF Timer Compare Interrupt Mask */
#define    BM_LTCIM	(uint8_t)(1U<<LTCIM)
#define    LTCM            5       /* LF Timer Continuous Mode */
#define    BM_LTCM	(uint8_t)(1U<<LTCM)
#define    LTSM            6       /* LF Timer Start Mode */
#define    BM_LTSM	(uint8_t)(1U<<LTSM)
#define    LTENA           7       /* LF Timer Enable */
#define    BM_LTENA	(uint8_t)(1U<<LTENA)

