camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* LTCOR - LF Timer Compare Register */
#define    LTCOR0          0       /*  */
#define    BM_LTCOR0	(uint8_t)(1U<<LTCOR0)
#define    LTCOR1          1       /*  */
#define    BM_LTCOR1	(uint8_t)(1U<<LTCOR1)
#define    LTCOR2          2       /*  */
#define    BM_LTCOR2	(uint8_t)(1U<<LTCOR2)
#define    LTCOR3          3       /*  */
#define    BM_LTCOR3	(uint8_t)(1U<<LTCOR3)
#define    LTCOR4          4       /*  */
#define    BM_LTCOR4	(uint8_t)(1U<<LTCOR4)
#define    LTCOR5          5       /*  */
#define    BM_LTCOR5	(uint8_t)(1U<<LTCOR5)
#define    LTCOR6          6       /*  */
#define    BM_LTCOR6	(uint8_t)(1U<<LTCOR6)
#define    LTCOR7          7       /*  */
#define    BM_LTCOR7	(uint8_t)(1U<<LTCOR7)

/* LTEMR - LF Timer Event Mask Register */
#define    ID0EM           0       /* ID0 Event Mask */
#define    BM_ID0EM	(uint8_t)(1U<<ID0EM)
#define    ID1EM           1       /* ID1 Event Mask */
#define    BM_ID1EM	(uint8_t)(1U<<ID1EM)
#define    IDFEM           2       /* Identifier Frame Event Mask */
#define    BM_IDFEM	(uint8_t)(1U<<IDFEM)
#define    DFEM            3       /* Data Frame end reached Event Mask */
#define    BM_DFEM	(uint8_t)(1U<<DFEM)
#define    TBLEM           4       /* Telegram Bit Length reached Event Mask */
#define    BM_TBLEM	(uint8_t)(1U<<TBLEM)
#define    FLEM            5       /* Fill Level reached Event Mask */
#define    BM_FLEM	(uint8_t)(1U<<FLEM)
#define    EOFEM           6       /* End OF telegram Event Mask */
#define    BM_EOFEM	(uint8_t)(1U<<EOFEM)
#define    LTCOF           7       /* LF Timer Compare Flag */
#define    BM_LTCOF	(uint8_t)(1U<<LTCOF)


/* ***** LF_TRANSPONDER *************** */
/* TPCR1 - Transponder Control Register 1 */
#define    TPQPLM          2       /* Transponder Quadrature Pulse Length Operation Modulation */
#define    BM_TPQPLM	(uint8_t)(1U<<TPQPLM)
#define    TPBR            4       /* Transponder Bit Rate */
#define    BM_TPBR	(uint8_t)(1U<<TPBR)
#define    TPDFCP0         5       /* Transponder Decoder Field Clock Prescaler value bit 0 */
#define    BM_TPDFCP0	(uint8_t)(1U<<TPDFCP0)
#define    TPDFCP1         6       /* Transponder Decoder Field Clock Prescaler value bit 1 */
#define    BM_TPDFCP1	(uint8_t)(1U<<TPDFCP1)
#define    TPMODE          7       /* Transponder Mode */
#define    BM_TPMODE	(uint8_t)(1U<<TPMODE)

/* TPCR2 - Transponder Control 2 Register */
#define    TPMA            0       /* Transponder Mode Acknowledge */
#define    BM_TPMA	(uint8_t)(1U<<TPMA)
#define    TPMOD           1       /* Transponder Modulation */
#define    BM_TPMOD	(uint8_t)(1U<<TPMOD)
#define    TPPSD           2       /* Transponder Power Switch Disable */
#define    BM_TPPSD	(uint8_t)(1U<<TPPSD)
#define    TPD             3       /* Transponder Disable */
#define    BM_TPD	(uint8_t)(1U<<TPD)
#define    TPNFTO          4       /* Transponder No Field Timeout enable */
#define    BM_TPNFTO	(uint8_t)(1U<<TPNFTO)
#define    TPWDLV0         5       /* Transponder watch dog value for No Field timeout (with SRC clk) bit 0 */
#define    BM_TPWDLV0	(uint8_t)(1U<<TPWDLV0)
#define    TPWDLV1         6       /* Transponder watch dog value for No Field timeout (with SRC clk) bit 1 */
#define    BM_TPWDLV1	(uint8_t)(1U<<TPWDLV1)

/* TPCR3 - Transponder Control Register 3 */
#define    TPTD            0       /* Transponder Transmit Data */
#define    BM_TPTD	(uint8_t)(1U<<TPTD)
#define    TPRD            1       /* Transponder Receive Data */
#define    BM_TPRD	(uint8_t)(1U<<TPRD)
#define    TPTLIW          2       /* Transponder Transmit Listen Window */
#define    BM_TPTLIW	(uint8_t)(1U<<TPTLIW)
#define    TPRCD           5       /* Transponder Reception Continuous Damping */
#define    BM_TPRCD	(uint8_t)(1U<<TPRCD)

/* TPCR4 - Transponder Control Register 4 */
#define    TPBCCS0         0       /* Transponder Battery Charge Current Select bit 0 */
#define    BM_TPBCCS0	(uint8_t)(1U<<TPBCCS0)
#define    TPBCCS1         1       /* Transponder Battery Charge Current Select bit 1 */
#define    BM_TPBCCS1	(uint8_t)(1U<<TPBCCS1)
#define    TPBCCS2         2       /* Transponder Battery Charge Current Select bit 2 */
#define    BM_TPBCCS2	(uint8_t)(1U<<TPBCCS2)
#define    TPBCCS3         3       /* Transponder Battery Charge Current Select bit 3 */
#define    BM_TPBCCS3	(uint8_t)(1U<<TPBCCS3)
#define    TPBCM           4       /* Transponder Battery Charge Mode */
#define    BM_TPBCM	(uint8_t)(1U<<TPBCM)

/* TPCR5 - Transponder Control Register 5 */
#define    TPMUD0          0       /* Transponder Modulation Undamped Level Select bit 0 */
#define    BM_TPMUD0	(uint8_t)(1U<<TPMUD0)
#define    TPMUD1          1       /* Transponder Modulation Undamped Level Select bit 1 */
#define    BM_TPMUD1	(uint8_t)(1U<<TPMUD1)
#define    TPMUD2          2       /* Transponder Modulation Undamped Level Select bit 2 */
#define    BM_TPMUD2	(uint8_t)(1U<<TPMUD2)
#define    TPMD0           4       /* Transponder Modulation Damping Select bit 0 */
#define    BM_TPMD0	(uint8_t)(1U<<TPMD0)
#define    TPMD1           5       /* Transponder Modulation Damping Select bit 1 */
#define    BM_TPMD1	(uint8_t)(1U<<TPMD1)
#define    TPMD2           6       /* Transponder Modulation Damping Select bit 2 */
#define    BM_TPMD2	(uint8_t)(1U<<TPMD2)

/* TPECMR - Transponder Encoder Mode Register */
#define    TPECM10         0       /* Transponder Encoder Mode 1 bit 0 */
#define    BM_TPECM10	(uint8_t)(1U<<TPECM10)
#define    TPECM11         1       /* Transponder Encoder Mode 1 bit 1 */
#define    BM_TPECM11	(uint8_t)(1U<<TPECM11)
#define    TPECM20         2       /* Transponder Encoder Mode 2 bit 0 */
#define    BM_TPECM20	(uint8_t)(1U<<TPECM20)
#define    TPECM21         3       /* Transponder Encoder Mode 2 bit 1 */
#define    BM_TPECM21	(uint8_t)(1U<<TPECM21)
#define    TPECM30         4       /* Transponder Encoder Mode 3 bit 0 */
#define    BM_TPECM30	(uint8_t)(1U<<TPECM30)
#define    TPECM31         5       /* Transponder Encoder Mode 3 bit 1 */
#define    BM_TPECM31	(uint8_t)(1U<<TPECM31)
#define    TPECM40         6       /* Transponder Encoder Mode 4 bit 0 */
#define    BM_TPECM40	(uint8_t)(1U<<TPECM40)
#define    TPECM41         7       /* Transponder Encoder Mode 4 bit 1 */
#define    BM_TPECM41	(uint8_t)(1U<<TPECM41)

/* TPFR - Transponder Flag Register */
#define    TPF             0       /* Transponder Flag */
#define    BM_TPF	(uint8_t)(1U<<TPF)
#define    TPFTF           1       /* Transponder Field Timeout Flag */
#define    BM_TPFTF	(uint8_t)(1U<<TPFTF)
#define    TPNFTF          2       /* Transponder No Field Timeout Flag */
#define    BM_TPNFTF	(uint8_t)(1U<<TPNFTF)
#define    TPBERF          3       /* Transponder Bit Error Flag */
#define    BM_TPBERF	(uint8_t)(1U<<TPBERF)

/* TPIMR - Transponder Interrupt Mask Register */
#define    TPIM            0       /* Transponder Interrupt Mask */
#define    BM_TPIM	(uint8_t)(1U<<TPIM)
#define    TPFTIM          1       /* Transponder Field Timeout Interrupt Mask */
#define    BM_TPFTIM	(uint8_t)(1U<<TPFTIM)
#define    TPNFTIM         2       /* Transponder No Field Timeout Interrupt Mask */
#define    BM_TPNFTIM	(uint8_t)(1U<<TPNFTIM)
#define    TPBERIM         3       /* Transponder Bit Error Interrupt Mask */
#define    BM_TPBERIM	(uint8_t)(1U<<TPBERIM)

