camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* TPSR - Transponder Status Register */
#define    TPA             0       /* Transponder Active */
#define    BM_TPA	(uint8_t)(1U<<TPA)
#define    TPGAP           1       /* Transponder GAP Signal */
#define    BM_TPGAP	(uint8_t)(1U<<TPGAP)
#define    TPPSW           2       /* Transponder Power Switch */
#define    BM_TPPSW	(uint8_t)(1U<<TPPSW)
#define    TPBCOK          3       /* Transponder Battery Charge OK */
#define    BM_TPBCOK	(uint8_t)(1U<<TPBCOK)


/* ***** MEM ************************** */
/* EEST - EEPROM Status Register */
#define    EESYN0          0       /* EEPROM Syndrome bit 0 */
#define    BM_EESYN0	(uint8_t)(1U<<EESYN0)
#define    EESYN1          1       /* EEPROM Syndrome bit 1 */
#define    BM_EESYN1	(uint8_t)(1U<<EESYN1)
#define    EESYN2          2       /* EEPROM Syndrome bit 2 */
#define    BM_EESYN2	(uint8_t)(1U<<EESYN2)
#define    EESYN3          3       /* EEPROM Syndrome bit 3 */
#define    BM_EESYN3	(uint8_t)(1U<<EESYN3)

/* PGMST - Program Memory Status Register */
#define    PGMSYN0         0       /* Program Memory Syndrome bit 0 */
#define    BM_PGMSYN0	(uint8_t)(1U<<PGMSYN0)
#define    PGMSYN1         1       /* Program Memory Syndrome bit 1 */
#define    BM_PGMSYN1	(uint8_t)(1U<<PGMSYN1)
#define    PGMSYN2         2       /* Program Memory Syndrome bit 2 */
#define    BM_PGMSYN2	(uint8_t)(1U<<PGMSYN2)
#define    PGMSYN3         3       /* Program Memory Syndrome bit 3 */
#define    BM_PGMSYN3	(uint8_t)(1U<<PGMSYN3)
#define    PGMSYN4         4       /* Program Memory Syndrome bit 4 */
#define    BM_PGMSYN4	(uint8_t)(1U<<PGMSYN4)


/* ***** PORTB ************************ */
/* DDRB - Port B Data Direction Register */
#define    DDRB0           0       /* Port B Data Direction Register bit 0 */
#define    BM_DDRB0	(uint8_t)(1U<<DDRB0)
#define    DDRB1           1       /* Port B Data Direction Register bit 1 */
#define    BM_DDRB1	(uint8_t)(1U<<DDRB1)
#define    DDRB2           2       /* Port B Data Direction Register bit 2 */
#define    BM_DDRB2	(uint8_t)(1U<<DDRB2)
#define    DDRB3           3       /* Port B Data Direction Register bit 3 */
#define    BM_DDRB3	(uint8_t)(1U<<DDRB3)
#define    DDRB4           4       /* Port B Data Direction Register bit 4 */
#define    BM_DDRB4	(uint8_t)(1U<<DDRB4)
#define    DDRB5           5       /* Port B Data Direction Register bit 5 */
#define    BM_DDRB5	(uint8_t)(1U<<DDRB5)
#define    DDRB6           6       /* Port B Data Direction Register bit 6 */
#define    BM_DDRB6	(uint8_t)(1U<<DDRB6)
#define    DDRB7           7       /* Port B Data Direction Register bit 7 */
#define    BM_DDRB7	(uint8_t)(1U<<DDRB7)

/* PINB - Port B Input Pins */
#define    PINB0           0       /* Port B Input Pins bit 0 */
#define    BM_PINB0	(uint8_t)(1U<<PINB0)
#define    PINB1           1       /* Port B Input Pins bit 1 */
#define    BM_PINB1	(uint8_t)(1U<<PINB1)
#define    PINB2           2       /* Port B Input Pins bit 2 */
#define    BM_PINB2	(uint8_t)(1U<<PINB2)
#define    PINB3           3       /* Port B Input Pins bit 3 */
#define    BM_PINB3	(uint8_t)(1U<<PINB3)
#define    PINB4           4       /* Port B Input Pins bit 4 */
#define    BM_PINB4	(uint8_t)(1U<<PINB4)
#define    PINB5           5       /* Port B Input Pins bit 5 */
#define    BM_PINB5	(uint8_t)(1U<<PINB5)
#define    PINB6           6       /* Port B Input Pins bit 6 */
#define    BM_PINB6	(uint8_t)(1U<<PINB6)
#define    PINB7           7       /* Port B Input Pins bit 7 */
#define    BM_PINB7	(uint8_t)(1U<<PINB7)

/* PORTB - Port B Data Register */
#define    PORTB0          0       /* Port B Data Register bit 0 */
#define    BM_PORTB0	(uint8_t)(1U<<PORTB0)
#define    PB0             0       /* For compatibility */
#define    BM_PB0	(uint8_t)(1U<<PB0)
#define    PORTB1          1       /* Port B Data Register bit 1 */
#define    BM_PORTB1	(uint8_t)(1U<<PORTB1)
#define    PB1             1       /* For compatibility */
#define    BM_PB1	(uint8_t)(1U<<PB1)
#define    PORTB2          2       /* Port B Data Register bit 2 */
#define    BM_PORTB2	(uint8_t)(1U<<PORTB2)
#define    PB2             2       /* For compatibility */
#define    BM_PB2	(uint8_t)(1U<<PB2)
#define    PORTB3          3       /* Port B Data Register bit 3 */
#define    BM_PORTB3	(uint8_t)(1U<<PORTB3)
#define    PB3             3       /* For compatibility */
#define    BM_PB3	(uint8_t)(1U<<PB3)
#define    PORTB4          4       /* Port B Data Register bit 4 */
#define    BM_PORTB4	(uint8_t)(1U<<PORTB4)
#define    PB4             4       /* For compatibility */
#define    BM_PB4	(uint8_t)(1U<<PB4)
#define    PORTB5          5       /* Port B Data Register bit 5 */
#define    BM_PORTB5	(uint8_t)(1U<<PORTB5)
#define    PB5             5       /* For compatibility */
#define    BM_PB5	(uint8_t)(1U<<PB5)
#define    PORTB6          6       /* Port B Data Register bit 6 */
#define    BM_PORTB6	(uint8_t)(1U<<PORTB6)
#define    PB6             6       /* For compatibility */
#define    BM_PB6	(uint8_t)(1U<<PB6)
#define    PORTB7          7       /* Port B Data Register bit 7 */
#define    BM_PORTB7	(uint8_t)(1U<<PORTB7)
#define    PB7             7       /* For compatibility */
#define    BM_PB7	(uint8_t)(1U<<PB7)


/* ***** PORTC ************************ */
/* DDRC - Port C Data Direction Register */
#define    DDRC0           0       /* Port C Data Direction Register bit 0 */
#define    BM_DDRC0	(uint8_t)(1U<<DDRC0)
#define    DDRC1           1       /* Port C Data Direction Register bit 1 */
#define    BM_DDRC1	(uint8_t)(1U<<DDRC1)
#define    DDRC2           2       /* Port C Data Direction Register bit 2 */
#define    BM_DDRC2	(uint8_t)(1U<<DDRC2)

/* PINC - Port C Input Pins */
#define    PINC0           0       /* Port C Input Pins bit 0 */
#define    BM_PINC0	(uint8_t)(1U<<PINC0)
#define    PINC1           1       /* Port C Input Pins bit 1 */
#define    BM_PINC1	(uint8_t)(1U<<PINC1)
#define    PINC2           2       /* Port C Input Pins bit 2 */
#define    BM_PINC2	(uint8_t)(1U<<PINC2)

