camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* PORTC - Port C Data Register */
#define    PORTC0          0       /* Port C Data Register bit 0 */
#define    BM_PORTC0	(uint8_t)(1U<<PORTC0)
#define    PC0             0       /* For compatibility */
#define    BM_PC0	(uint8_t)(1U<<PC0)
#define    PORTC1          1       /* Port C Data Register bit 1 */
#define    BM_PORTC1	(uint8_t)(1U<<PORTC1)
#define    PC1             1       /* For compatibility */
#define    BM_PC1	(uint8_t)(1U<<PC1)
#define    PORTC2          2       /* Port C Data Register bit 2 */
#define    BM_PORTC2	(uint8_t)(1U<<PORTC2)
#define    PC2             2       /* For compatibility */
#define    BM_PC2	(uint8_t)(1U<<PC2)


/* ***** PORTD ************************ */
/* DDRD - Port D Data Direction Register */
#define    DDRD0           0       /* Port D Data Direction Register bit 0 */
#define    BM_DDRD0	(uint8_t)(1U<<DDRD0)
#define    DDRD1           1       /* Port D Data Direction Register bit 1 */
#define    BM_DDRD1	(uint8_t)(1U<<DDRD1)
#define    DDRD2           2       /* Port D Data Direction Register bit 2 */
#define    BM_DDRD2	(uint8_t)(1U<<DDRD2)
#define    DDRD3           3       /* Port D Data Direction Register bit 3 */
#define    BM_DDRD3	(uint8_t)(1U<<DDRD3)
#define    DDRD4           4       /* Port D Data Direction Register bit 4 */
#define    BM_DDRD4	(uint8_t)(1U<<DDRD4)
#define    DDRD5           5       /* Port D Data Direction Register bit 5 */
#define    BM_DDRD5	(uint8_t)(1U<<DDRD5)
#define    DDRD6           6       /* Port D Data Direction Register bit 6 */
#define    BM_DDRD6	(uint8_t)(1U<<DDRD6)
#define    DDRD7           7       /* Port D Data Direction Register bit 7 */
#define    BM_DDRD7	(uint8_t)(1U<<DDRD7)

/* PIND - Port D Input Pins */
#define    PIND0           0       /* Port D Input Pins bit 0 */
#define    BM_PIND0	(uint8_t)(1U<<PIND0)
#define    PIND1           1       /* Port D Input Pins bit 1 */
#define    BM_PIND1	(uint8_t)(1U<<PIND1)
#define    PIND2           2       /* Port D Input Pins bit 2 */
#define    BM_PIND2	(uint8_t)(1U<<PIND2)
#define    PIND3           3       /* Port D Input Pins bit 3 */
#define    BM_PIND3	(uint8_t)(1U<<PIND3)
#define    PIND4           4       /* Port D Input Pins bit 4 */
#define    BM_PIND4	(uint8_t)(1U<<PIND4)
#define    PIND5           5       /* Port D Input Pins bit 5 */
#define    BM_PIND5	(uint8_t)(1U<<PIND5)
#define    PIND6           6       /* Port D Input Pins bit 6 */
#define    BM_PIND6	(uint8_t)(1U<<PIND6)
#define    PIND7           7       /* Port D Input Pins bit 7 */
#define    BM_PIND7	(uint8_t)(1U<<PIND7)

/* PORTD - Port D Data Register */
#define    PORTD0          0       /* Port D Data Register bit 0 */
#define    BM_PORTD0	(uint8_t)(1U<<PORTD0)
#define    PD0             0       /* For compatibility */
#define    BM_PD0	(uint8_t)(1U<<PD0)
#define    PORTD1          1       /* Port D Data Register bit 1 */
#define    BM_PORTD1	(uint8_t)(1U<<PORTD1)
#define    PD1             1       /* For compatibility */
#define    BM_PD1	(uint8_t)(1U<<PD1)
#define    PORTD2          2       /* Port D Data Register bit 2 */
#define    BM_PORTD2	(uint8_t)(1U<<PORTD2)
#define    PD2             2       /* For compatibility */
#define    BM_PD2	(uint8_t)(1U<<PD2)
#define    PORTD3          3       /* Port D Data Register bit 3 */
#define    BM_PORTD3	(uint8_t)(1U<<PORTD3)
#define    PD3             3       /* For compatibility */
#define    BM_PD3	(uint8_t)(1U<<PD3)
#define    PORTD4          4       /* Port D Data Register bit 4 */
#define    BM_PORTD4	(uint8_t)(1U<<PORTD4)
#define    PD4             4       /* For compatibility */
#define    BM_PD4	(uint8_t)(1U<<PD4)
#define    PORTD5          5       /* Port D Data Register bit 5 */
#define    BM_PORTD5	(uint8_t)(1U<<PORTD5)
#define    PD5             5       /* For compatibility */
#define    BM_PD5	(uint8_t)(1U<<PD5)
#define    PORTD6          6       /* Port D Data Register bit 6 */
#define    BM_PORTD6	(uint8_t)(1U<<PORTD6)
#define    PD6             6       /* For compatibility */
#define    BM_PD6	(uint8_t)(1U<<PD6)
#define    PORTD7          7       /* Port D Data Register bit 7 */
#define    BM_PORTD7	(uint8_t)(1U<<PORTD7)
#define    PD7             7       /* For compatibility */
#define    BM_PD7	(uint8_t)(1U<<PD7)


/* ***** SFIFO ************************ */
/* SFC - Support FIFO Configuration Register */
#define    SFFLC0          0       /* Support FIFO Fill-Level Configuration bit 0 */
#define    BM_SFFLC0	(uint8_t)(1U<<SFFLC0)
#define    SFFLC1          1       /* Support FIFO Fill-Level Configuration bit 1 */
#define    BM_SFFLC1	(uint8_t)(1U<<SFFLC1)
#define    SFFLC2          2       /* Support FIFO Fill-Level Configuration bit 2 */
#define    BM_SFFLC2	(uint8_t)(1U<<SFFLC2)
#define    SFFLC3          3       /* Support FIFO Fill-Level Configuration bit 3 */
#define    BM_SFFLC3	(uint8_t)(1U<<SFFLC3)
#define    SFFLC4          4       /* Support FIFO Fill-Level Configuration bit 4 */
#define    BM_SFFLC4	(uint8_t)(1U<<SFFLC4)
#define    SFDRA           7       /* Support FIFO Direct Read Access Operational Mode */
#define    BM_SFDRA	(uint8_t)(1U<<SFDRA)

/* SFI - Support FIFO Interrupt Mask Register */
#define    SFFLIM          0       /* Support FIFO Fill-level Interrupt Mask */
#define    BM_SFFLIM	(uint8_t)(1U<<SFFLIM)
#define    SFERIM          1       /* Support FIFO Error Interrupt Mask */
#define    BM_SFERIM	(uint8_t)(1U<<SFERIM)

/* SFL - Support FIFO Fill Level Register */
#define    SFFLS0          0       /* Support FIFO Fill Level Status bit 0 */
#define    BM_SFFLS0	(uint8_t)(1U<<SFFLS0)
#define    SFFLS1          1       /* Support FIFO Fill Level Status bit 1 */
#define    BM_SFFLS1	(uint8_t)(1U<<SFFLS1)
#define    SFFLS2          2       /* Support FIFO Fill Level Status bit 2 */
#define    BM_SFFLS2	(uint8_t)(1U<<SFFLS2)
#define    SFFLS3          3       /* Support FIFO Fill Level Status bit 3 */
#define    BM_SFFLS3	(uint8_t)(1U<<SFFLS3)
#define    SFFLS4          4       /* Support FIFO Fill Level Status bit 4 */
#define    BM_SFFLS4	(uint8_t)(1U<<SFFLS4)
#define    SFCLR           7       /* Support FIFO Clear */
#define    BM_SFCLR	(uint8_t)(1U<<SFCLR)

/* SFRP - Support FIFO Read Pointer */
#define    SFRP0           0       /* Support FIFO Read Pointer bit 0 */
#define    BM_SFRP0	(uint8_t)(1U<<SFRP0)
#define    SFRP1           1       /* Support FIFO Read Pointer bit 1 */
#define    BM_SFRP1	(uint8_t)(1U<<SFRP1)
#define    SFRP2           2       /* Support FIFO Read Pointer bit 2 */
#define    BM_SFRP2	(uint8_t)(1U<<SFRP2)
#define    SFRP3           3       /* Support FIFO Read Pointer bit 3 */
#define    BM_SFRP3	(uint8_t)(1U<<SFRP3)
#define    SFRP4           4       /* Support FIFO Read Pointer bit 4 */
#define    BM_SFRP4	(uint8_t)(1U<<SFRP4)

/* SFS - Support FIFO Status Register */
#define    SFFLRF          0       /* Support FIFO Fill-Level Reached Status Flag */
#define    BM_SFFLRF	(uint8_t)(1U<<SFFLRF)
#define    SFUFL           1       /* Support FIFO Underflow Flag */
#define    BM_SFUFL	(uint8_t)(1U<<SFUFL)
#define    SFOFL           2       /* Support FIFO Overflow Flag */
#define    BM_SFOFL	(uint8_t)(1U<<SFOFL)

/* SFWP - Support FIFO Write Pointer */
#define    SFWP0           0       /* Support FIFO Write Pointer bit 0 */
#define    BM_SFWP0	(uint8_t)(1U<<SFWP0)
#define    SFWP1           1       /* Support FIFO Write Pointer bit 1 */
#define    BM_SFWP1	(uint8_t)(1U<<SFWP1)
#define    SFWP2           2       /* Support FIFO Write Pointer bit 2 */
#define    BM_SFWP2	(uint8_t)(1U<<SFWP2)
#define    SFWP3           3       /* Support FIFO Write Pointer bit 3 */
#define    BM_SFWP3	(uint8_t)(1U<<SFWP3)
#define    SFWP4           4       /* Support FIFO Write Pointer bit 4 */
#define    BM_SFWP4	(uint8_t)(1U<<SFWP4)


/* ***** SPI ************************** */
/* SFFR - SPI FIFO Fill Status Register */
#define    RFL0            0       /* Receive Buffer Fill Level bit 0 */
#define    BM_RFL0	(uint8_t)(1U<<RFL0)
#define    RFL1            1       /* Receive Buffer Fill Level bit 1 */
#define    BM_RFL1	(uint8_t)(1U<<RFL1)
#define    RFL2            2       /* Receive Buffer Fill Level bit 2 */
#define    BM_RFL2	(uint8_t)(1U<<RFL2)
#define    RFC             3       /* Rx Buffer Clear */
#define    BM_RFC	(uint8_t)(1U<<RFC)
#define    TFL0            4       /* Transmit Buffer Fill Level bit 0 */
#define    BM_TFL0	(uint8_t)(1U<<TFL0)
#define    TFL1            5       /* Transmit Buffer Fill Level bit 1 */
#define    BM_TFL1	(uint8_t)(1U<<TFL1)
#define    TFL2            6       /* Transmit Buffer Fill Level bit 2 */
#define    BM_TFL2	(uint8_t)(1U<<TFL2)
#define    TFC             7       /* SPI Tx Buffer Clear */
#define    BM_TFC	(uint8_t)(1U<<TFC)

/* SFIR - SPI FIFO Interrupt Register */
#define    RIL0            0       /* Receive Buffer Interrupt Level bit 0 */
#define    BM_RIL0	(uint8_t)(1U<<RIL0)
#define    RIL1            1       /* Receive Buffer Interrupt Level bit 1 */
#define    BM_RIL1	(uint8_t)(1U<<RIL1)
#define    RIL2            2       /* Receive Buffer Interrupt Level bit 2 */
#define    BM_RIL2	(uint8_t)(1U<<RIL2)
#define    SRIE            3       /* Rx Buffer Interrupt Enable */
#define    BM_SRIE	(uint8_t)(1U<<SRIE)
#define    TIL0            4       /* Transmit Buffer Interrupt Level bit 0 */
#define    BM_TIL0	(uint8_t)(1U<<TIL0)
#define    TIL1            5       /* Transmit Buffer Interrupt Level bit 1 */
#define    BM_TIL1	(uint8_t)(1U<<TIL1)
#define    TIL2            6       /* Transmit Buffer Interrupt Level bit 2 */
#define    BM_TIL2	(uint8_t)(1U<<TIL2)
#define    STIE            7       /* SPI Rx Buffer Interrupt Enable */
#define    BM_STIE	(uint8_t)(1U<<STIE)

