camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* T5CNTH - Timer5 Counter High byte */
#define    T5CNT8          0       /* Timer5 Counter bit 8 */
#define    BM_T5CNT8	(uint8_t)(1U<<T5CNT8)
#define    T5CNT9          1       /* Timer5 Counter bit 9 */
#define    BM_T5CNT9	(uint8_t)(1U<<T5CNT9)
#define    T5CNT10         2       /* Timer5 Counter bit 10 */
#define    BM_T5CNT10	(uint8_t)(1U<<T5CNT10)
#define    T5CNT11         3       /* Timer5 Counter bit 11 */
#define    BM_T5CNT11	(uint8_t)(1U<<T5CNT11)
#define    T5CNT12         4       /* Timer5 Counter bit 12 */
#define    BM_T5CNT12	(uint8_t)(1U<<T5CNT12)
#define    T5CNT13         5       /* Timer5 Counter bit 13 */
#define    BM_T5CNT13	(uint8_t)(1U<<T5CNT13)
#define    T5CNT14         6       /* Timer5 Counter bit 14 */
#define    BM_T5CNT14	(uint8_t)(1U<<T5CNT14)
#define    T5CNT15         7       /* Timer5 Counter bit 15 */
#define    BM_T5CNT15	(uint8_t)(1U<<T5CNT15)

/* T5CNTL - Timer5 Counter Low byte */
#define    T5CNT0          0       /* Timer5 Counter bit 0 */
#define    BM_T5CNT0	(uint8_t)(1U<<T5CNT0)
#define    T5CNT1          1       /* Timer5 Counter bit 1 */
#define    BM_T5CNT1	(uint8_t)(1U<<T5CNT1)
#define    T5CNT2          2       /* Timer5 Counter bit 2 */
#define    BM_T5CNT2	(uint8_t)(1U<<T5CNT2)
#define    T5CNT3          3       /* Timer5 Counter bit 3 */
#define    BM_T5CNT3	(uint8_t)(1U<<T5CNT3)
#define    T5CNT4          4       /* Timer5 Counter bit 4 */
#define    BM_T5CNT4	(uint8_t)(1U<<T5CNT4)
#define    T5CNT5          5       /* Timer5 Counter bit 5 */
#define    BM_T5CNT5	(uint8_t)(1U<<T5CNT5)
#define    T5CNT6          6       /* Timer5 Counter bit 6 */
#define    BM_T5CNT6	(uint8_t)(1U<<T5CNT6)
#define    T5CNT7          7       /* Timer5 Counter bit 7 */
#define    BM_T5CNT7	(uint8_t)(1U<<T5CNT7)

/* T5IFR - Timer5 Interrupt Flag Register */
#define    T5OFF           0       /* Timer5 Output Overflow Flag */
#define    BM_T5OFF	(uint8_t)(1U<<T5OFF)
#define    T5COF           1       /* Timer5 Output Compare Output Match Flag */
#define    BM_T5COF	(uint8_t)(1U<<T5COF)

/* T5IMR - Timer5 Interrupt Mask Register */
#define    T5OIM           0       /* Timer5 Output Overflow Interrupt Mask */
#define    BM_T5OIM	(uint8_t)(1U<<T5OIM)
#define    T5CIM           1       /* Timer5 Output Compare Interrupt Mask */
#define    BM_T5CIM	(uint8_t)(1U<<T5CIM)

/* T5OCRH - Timer5 Output Compare Register High byte */
#define    T5OCR8          0       /* Timer5 Output Compare Register bit 8 */
#define    BM_T5OCR8	(uint8_t)(1U<<T5OCR8)
#define    T5OCR9          1       /* Timer5 Output Compare Register bit 9 */
#define    BM_T5OCR9	(uint8_t)(1U<<T5OCR9)
#define    T5OCR10         2       /* Timer5 Output Compare Register bit 10 */
#define    BM_T5OCR10	(uint8_t)(1U<<T5OCR10)
#define    T5OCR11         3       /* Timer5 Output Compare Register bit 11 */
#define    BM_T5OCR11	(uint8_t)(1U<<T5OCR11)
#define    T5OCR12         4       /* Timer5 Output Compare Register bit 12 */
#define    BM_T5OCR12	(uint8_t)(1U<<T5OCR12)
#define    T5OCR13         5       /* Timer5 Output Compare Register bit 13 */
#define    BM_T5OCR13	(uint8_t)(1U<<T5OCR13)
#define    T5OCR14         6       /* Timer5 Output Compare Register bit 14 */
#define    BM_T5OCR14	(uint8_t)(1U<<T5OCR14)
#define    T5OCR15         7       /* Timer5 Output Compare Register bit 15 */
#define    BM_T5OCR15	(uint8_t)(1U<<T5OCR15)

/* T5OCRL - Timer5 Output Compare Register Low byte */
#define    T5OCR0          0       /* Timer5 Output Compare Register bit 0 */
#define    BM_T5OCR0	(uint8_t)(1U<<T5OCR0)
#define    T5OCR1          1       /* Timer5 Output Compare Register bit 1 */
#define    BM_T5OCR1	(uint8_t)(1U<<T5OCR1)
#define    T5OCR2          2       /* Timer5 Output Compare Register bit 2 */
#define    BM_T5OCR2	(uint8_t)(1U<<T5OCR2)
#define    T5OCR3          3       /* Timer5 Output Compare Register bit 3 */
#define    BM_T5OCR3	(uint8_t)(1U<<T5OCR3)
#define    T5OCR4          4       /* Timer5 Output Compare Register bit 4 */
#define    BM_T5OCR4	(uint8_t)(1U<<T5OCR4)
#define    T5OCR5          5       /* Timer5 Output Compare Register bit 5 */
#define    BM_T5OCR5	(uint8_t)(1U<<T5OCR5)
#define    T5OCR6          6       /* Timer5 Output Compare Register bit 6 */
#define    BM_T5OCR6	(uint8_t)(1U<<T5OCR6)
#define    T5OCR7          7       /* Timer5 Output Compare Register bit 7 */
#define    BM_T5OCR7	(uint8_t)(1U<<T5OCR7)

/* T5TEMP - Timer5 Temp Register */
#define    T5TEMP0         0       /* Timer5 Temp bit 0 */
#define    BM_T5TEMP0	(uint8_t)(1U<<T5TEMP0)
#define    T5TEMP1         1       /* Timer5 Temp bit 1 */
#define    BM_T5TEMP1	(uint8_t)(1U<<T5TEMP1)
#define    T5TEMP2         2       /* Timer5 Temp bit 2 */
#define    BM_T5TEMP2	(uint8_t)(1U<<T5TEMP2)
#define    T5TEMP3         3       /* Timer5 Temp bit 3 */
#define    BM_T5TEMP3	(uint8_t)(1U<<T5TEMP3)
#define    T5TEMP4         4       /* Timer5 Temp bit 4 */
#define    BM_T5TEMP4	(uint8_t)(1U<<T5TEMP4)
#define    T5TEMP5         5       /* Timer5 Temp bit 5 */
#define    BM_T5TEMP5	(uint8_t)(1U<<T5TEMP5)
#define    T5TEMP6         6       /* Timer5 Temp bit 6 */
#define    BM_T5TEMP6	(uint8_t)(1U<<T5TEMP6)
#define    T5TEMP7         7       /* Timer5 Temp bit 7 */
#define    BM_T5TEMP7	(uint8_t)(1U<<T5TEMP7)


/* ***** TMO ************************** */
/* TMOCR - Timer Modulator Output Control Register */
#define    TO1PIS0         0       /* Timer modulator Output 1 Port Interface Select bit 0 */
#define    BM_TO1PIS0	(uint8_t)(1U<<TO1PIS0)
#define    TO1PIS1         1       /* Timer modulator Output 1 Port Interface Select bit 1 */
#define    BM_TO1PIS1	(uint8_t)(1U<<TO1PIS1)
#define    TO2PIS0         2       /* Timer modulator Output 2 Port Interface Select bit 0 */
#define    BM_TO2PIS0	(uint8_t)(1U<<TO2PIS0)
#define    TO2PIS1         3       /* Timer modulator Output 2 Port Interface Select bit 1 */
#define    BM_TO2PIS1	(uint8_t)(1U<<TO2PIS1)
#define    TO3PIS0         4       /* Timer modulator Output 3 Port Interface Select bit 0 */
#define    BM_TO3PIS0	(uint8_t)(1U<<TO3PIS0)
#define    TO3PIS1         5       /* Timer modulator Output 3 Port Interface Select bit 1 */
#define    BM_TO3PIS1	(uint8_t)(1U<<TO3PIS1)
#define    TO4PIS0         6       /* Timer modulator Output 4 Port Interface Select bit 0 */
#define    BM_TO4PIS0	(uint8_t)(1U<<TO4PIS0)
#define    TO4PIS1         7       /* Timer modulator Output 4 Port Interface Select bit 1 */
#define    BM_TO4PIS1	(uint8_t)(1U<<TO4PIS1)


/* ***** TPLF_CAL ********************* */
/* LFCPR - LF Receiver Calibration Protect Register */
#define    LFCALP          0       /* LF Calibration Protection */
#define    BM_LFCALP	(uint8_t)(1U<<LFCALP)
#define    LFCALRY         1       /* LF Calibration Ready */
#define    BM_LFCALRY	(uint8_t)(1U<<LFCALRY)
#define    TPCD            6       /* Transponder Constant Disable */
#define    BM_TPCD	(uint8_t)(1U<<TPCD)
#define    LFCPCE          7       /* LF Calibration Protect Change Enable */
#define    BM_LFCPCE	(uint8_t)(1U<<LFCPCE)

