camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* SRCCAL - Slow RC oscillator calibration */
#define    SRCCAL1         0       /* Slow RC oscillator calibration bit 1 */
#define    BM_SRCCAL1	(uint8_t)(1U<<SRCCAL1)
#define    SRCCAL2         1       /* Slow RC oscillator calibration bit 2 */
#define    BM_SRCCAL2	(uint8_t)(1U<<SRCCAL2)
#define    SRCCAL3         2       /* Slow RC oscillator calibration bit 3 */
#define    BM_SRCCAL3	(uint8_t)(1U<<SRCCAL3)
#define    SRCCAL4         3       /* Slow RC oscillator calibration bit 4 */
#define    BM_SRCCAL4	(uint8_t)(1U<<SRCCAL4)
#define    SRCCAL5         4       /* Slow RC oscillator calibration bit 5 */
#define    BM_SRCCAL5	(uint8_t)(1U<<SRCCAL5)
#define    SRCCAL6         5       /* Slow RC oscillator calibration bit 6 */
#define    BM_SRCCAL6	(uint8_t)(1U<<SRCCAL6)
#define    SRCCAL7         6       /* Slow RC oscillator calibration bit 7 */
#define    BM_SRCCAL7	(uint8_t)(1U<<SRCCAL7)
#define    SRCCAL8         7       /* Slow RC oscillator calibration bit 8 */
#define    BM_SRCCAL8	(uint8_t)(1U<<SRCCAL8)

/* SRCCALL - Slow RC oscillator calibration LSB */
#define    SRCCAL0         0       /* Slow RC oscillator calibration bit 0 */
#define    BM_SRCCAL0	(uint8_t)(1U<<SRCCAL0)

/* SRCTCAL - SRC oscillator Temperature Compensation register */
#define    SRCTC0          0       /* SRC Oscillator Temperature Compensation bit 0 */
#define    BM_SRCTC0	(uint8_t)(1U<<SRCTC0)
#define    SRCTC1          1       /* SRC Oscillator Temperature Compensation bit 1 */
#define    BM_SRCTC1	(uint8_t)(1U<<SRCTC1)
#define    SRCTC2          2       /* SRC Oscillator Temperature Compensation bit 2 */
#define    BM_SRCTC2	(uint8_t)(1U<<SRCTC2)
#define    SRCS0           3       /* SRC Oscillator Select delta current bit 0 */
#define    BM_SRCS0	(uint8_t)(1U<<SRCS0)
#define    SRCS1           4       /* SRC Oscillator Select delta current bit 1 */
#define    BM_SRCS1	(uint8_t)(1U<<SRCS1)
#define    DIS_SRC         6       /* Disable SRC Bandgap */
#define    BM_DIS_SRC	(uint8_t)(1U<<DIS_SRC)
#define    HOLD_SRC        7       /* Stop SRC-Osccillator output */
#define    BM_HOLD_SRC	(uint8_t)(1U<<HOLD_SRC)


/* ***** TWI1 ************************* */
/* TW1AMR - TWI1 Address Mask Register */
#define    TW1AM0          1       /* TWI1 Address Mask bit 0 */
#define    BM_TW1AM0	(uint8_t)(1U<<TW1AM0)
#define    TW1AM1          2       /* TWI1 Address Mask bit 1 */
#define    BM_TW1AM1	(uint8_t)(1U<<TW1AM1)
#define    TW1AM2          3       /* TWI1 Address Mask bit 2 */
#define    BM_TW1AM2	(uint8_t)(1U<<TW1AM2)
#define    TW1AM3          4       /* TWI1 Address Mask bit 3 */
#define    BM_TW1AM3	(uint8_t)(1U<<TW1AM3)
#define    TW1AM4          5       /* TWI1 Address Mask bit 4 */
#define    BM_TW1AM4	(uint8_t)(1U<<TW1AM4)
#define    TW1AM5          6       /* TWI1 Address Mask bit 5 */
#define    BM_TW1AM5	(uint8_t)(1U<<TW1AM5)
#define    TW1AM6          7       /* TWI1 Address Mask bit 6 */
#define    BM_TW1AM6	(uint8_t)(1U<<TW1AM6)

/* TW1AR - TWI1 (Slave) Address Register */
#define    TW1GCE          0       /* TWI1 General Call Recognition Enable */
#define    BM_TW1GCE	(uint8_t)(1U<<TW1GCE)
#define    TW1A0           1       /* TWI1 (Slave) Address bit 0 */
#define    BM_TW1A0	(uint8_t)(1U<<TW1A0)
#define    TW1A1           2       /* TWI1 (Slave) Address bit 1 */
#define    BM_TW1A1	(uint8_t)(1U<<TW1A1)
#define    TW1A2           3       /* TWI1 (Slave) Address bit 2 */
#define    BM_TW1A2	(uint8_t)(1U<<TW1A2)
#define    TW1A3           4       /* TWI1 (Slave) Address bit 3 */
#define    BM_TW1A3	(uint8_t)(1U<<TW1A3)
#define    TW1A4           5       /* TWI1 (Slave) Address bit 4 */
#define    BM_TW1A4	(uint8_t)(1U<<TW1A4)
#define    TW1A5           6       /* TWI1 (Slave) Address bit 5 */
#define    BM_TW1A5	(uint8_t)(1U<<TW1A5)
#define    TW1A6           7       /* TWI1 (Slave) Address bit 6 */
#define    BM_TW1A6	(uint8_t)(1U<<TW1A6)

/* TW1BR - TWI1 Bit Rate Register */
#define    TW1BR0          0       /* TWI1 Bit Rate bit 0 */
#define    BM_TW1BR0	(uint8_t)(1U<<TW1BR0)
#define    TW1BR1          1       /* TWI1 Bit Rate bit 1 */
#define    BM_TW1BR1	(uint8_t)(1U<<TW1BR1)
#define    TW1BR2          2       /* TWI1 Bit Rate bit 2 */
#define    BM_TW1BR2	(uint8_t)(1U<<TW1BR2)
#define    TW1BR3          3       /* TWI1 Bit Rate bit 3 */
#define    BM_TW1BR3	(uint8_t)(1U<<TW1BR3)
#define    TW1BR4          4       /* TWI1 Bit Rate bit 4 */
#define    BM_TW1BR4	(uint8_t)(1U<<TW1BR4)
#define    TW1BR5          5       /* TWI1 Bit Rate bit 5 */
#define    BM_TW1BR5	(uint8_t)(1U<<TW1BR5)
#define    TW1BR6          6       /* TWI1 Bit Rate bit 6 */
#define    BM_TW1BR6	(uint8_t)(1U<<TW1BR6)
#define    TW1BR7          7       /* TWI1 Bit Rate bit 7 */
#define    BM_TW1BR7	(uint8_t)(1U<<TW1BR7)

/* TW1CR - TWI1 Control Register */
#define    TW1IE           0       /* TWI1 Interrupt Enable */
#define    BM_TW1IE	(uint8_t)(1U<<TW1IE)
#define    TW1EN           2       /* TWI1 Enable */
#define    BM_TW1EN	(uint8_t)(1U<<TW1EN)
#define    TW1WC           3       /* TWI1 Write Collision Flag */
#define    BM_TW1WC	(uint8_t)(1U<<TW1WC)
#define    TW1STO          4       /* TWI1 STOP Condition */
#define    BM_TW1STO	(uint8_t)(1U<<TW1STO)
#define    TW1STA          5       /* TWI1 START Condition */
#define    BM_TW1STA	(uint8_t)(1U<<TW1STA)
#define    TW1EA           6       /* TWI1 Enable Acknowledge */
#define    BM_TW1EA	(uint8_t)(1U<<TW1EA)
#define    TW1INT          7       /* TWI1 Interrupt Flag */
#define    BM_TW1INT	(uint8_t)(1U<<TW1INT)

/* TW1DR - TWI1 Data Register */
#define    TW1D0           0       /* TWI1 Data bit 0 */
#define    BM_TW1D0	(uint8_t)(1U<<TW1D0)
#define    TW1D1           1       /* TWI1 Data bit 1 */
#define    BM_TW1D1	(uint8_t)(1U<<TW1D1)
#define    TW1D2           2       /* TWI1 Data bit 2 */
#define    BM_TW1D2	(uint8_t)(1U<<TW1D2)
#define    TW1D3           3       /* TWI1 Data bit 3 */
#define    BM_TW1D3	(uint8_t)(1U<<TW1D3)
#define    TW1D4           4       /* TWI1 Data bit 4 */
#define    BM_TW1D4	(uint8_t)(1U<<TW1D4)
#define    TW1D5           5       /* TWI1 Data bit 5 */
#define    BM_TW1D5	(uint8_t)(1U<<TW1D5)
#define    TW1D6           6       /* TWI1 Data bit 6 */
#define    BM_TW1D6	(uint8_t)(1U<<TW1D6)
#define    TW1D7           7       /* TWI1 Data bit 7 */
#define    BM_TW1D7	(uint8_t)(1U<<TW1D7)

/* TW1SR - TWI1 Status Register */
#define    TW1PS0          0       /* TWI1 Prescaler bit 0 */
#define    BM_TW1PS0	(uint8_t)(1U<<TW1PS0)
#define    TW1PS1          1       /* TWI1 Prescaler bit 1 */
#define    BM_TW1PS1	(uint8_t)(1U<<TW1PS1)
#define    TW1S0           3       /* TWI1 Status bit 0 */
#define    BM_TW1S0	(uint8_t)(1U<<TW1S0)
#define    TW1S1           4       /* TWI1 Status bit 1 */
#define    BM_TW1S1	(uint8_t)(1U<<TW1S1)
#define    TW1S2           5       /* TWI1 Status bit 2 */
#define    BM_TW1S2	(uint8_t)(1U<<TW1S2)
#define    TW1S3           6       /* TWI1 Status bit 3 */
#define    BM_TW1S3	(uint8_t)(1U<<TW1S3)
#define    TW1S4           7       /* TWI1 Status bit 4 */
#define    BM_TW1S4	(uint8_t)(1U<<TW1S4)


/* ***** TWI2 ************************* */
/* TW2AMR - TWI2 Address Mask Register */
#define    TW2AM0          1       /* TWI2 Address Mask bit 0 */
#define    BM_TW2AM0	(uint8_t)(1U<<TW2AM0)
#define    TW2AM1          2       /* TWI2 Address Mask bit 1 */
#define    BM_TW2AM1	(uint8_t)(1U<<TW2AM1)
#define    TW2AM2          3       /* TWI2 Address Mask bit 2 */
#define    BM_TW2AM2	(uint8_t)(1U<<TW2AM2)
#define    TW2AM3          4       /* TWI2 Address Mask bit 3 */
#define    BM_TW2AM3	(uint8_t)(1U<<TW2AM3)
#define    TW2AM4          5       /* TWI2 Address Mask bit 4 */
#define    BM_TW2AM4	(uint8_t)(1U<<TW2AM4)
#define    TW2AM5          6       /* TWI2 Address Mask bit 5 */
#define    BM_TW2AM5	(uint8_t)(1U<<TW2AM5)
#define    TW2AM6          7       /* TWI2 Address Mask bit 6 */
#define    BM_TW2AM6	(uint8_t)(1U<<TW2AM6)

