camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5702M322.h
/* TW2AR - TWI2 (Slave) Address Register */
#define    TW2GCE          0       /* TWI2 General Call Recognition Enable */
#define    BM_TW2GCE	(uint8_t)(1U<<TW2GCE)
#define    TW2A0           1       /* TWI2 (Slave) Address bit 0 */
#define    BM_TW2A0	(uint8_t)(1U<<TW2A0)
#define    TW2A1           2       /* TWI2 (Slave) Address bit 1 */
#define    BM_TW2A1	(uint8_t)(1U<<TW2A1)
#define    TW2A2           3       /* TWI2 (Slave) Address bit 2 */
#define    BM_TW2A2	(uint8_t)(1U<<TW2A2)
#define    TW2A3           4       /* TWI2 (Slave) Address bit 3 */
#define    BM_TW2A3	(uint8_t)(1U<<TW2A3)
#define    TW2A4           5       /* TWI2 (Slave) Address bit 4 */
#define    BM_TW2A4	(uint8_t)(1U<<TW2A4)
#define    TW2A5           6       /* TWI2 (Slave) Address bit 5 */
#define    BM_TW2A5	(uint8_t)(1U<<TW2A5)
#define    TW2A6           7       /* TWI2 (Slave) Address bit 6 */
#define    BM_TW2A6	(uint8_t)(1U<<TW2A6)

/* TW2BR - TWI2 Bit Rate Register */
#define    TW2BR0          0       /* TWI2 Bit Rate bit 0 */
#define    BM_TW2BR0	(uint8_t)(1U<<TW2BR0)
#define    TW2BR1          1       /* TWI2 Bit Rate bit 1 */
#define    BM_TW2BR1	(uint8_t)(1U<<TW2BR1)
#define    TW2BR2          2       /* TWI2 Bit Rate bit 2 */
#define    BM_TW2BR2	(uint8_t)(1U<<TW2BR2)
#define    TW2BR3          3       /* TWI2 Bit Rate bit 3 */
#define    BM_TW2BR3	(uint8_t)(1U<<TW2BR3)
#define    TW2BR4          4       /* TWI2 Bit Rate bit 4 */
#define    BM_TW2BR4	(uint8_t)(1U<<TW2BR4)
#define    TW2BR5          5       /* TWI2 Bit Rate bit 5 */
#define    BM_TW2BR5	(uint8_t)(1U<<TW2BR5)
#define    TW2BR6          6       /* TWI2 Bit Rate bit 6 */
#define    BM_TW2BR6	(uint8_t)(1U<<TW2BR6)
#define    TW2BR7          7       /* TWI2 Bit Rate bit 7 */
#define    BM_TW2BR7	(uint8_t)(1U<<TW2BR7)

/* TW2CR - TWI2 Control Register */
#define    TW2IE           0       /* TWI2 Interrupt Enable */
#define    BM_TW2IE	(uint8_t)(1U<<TW2IE)
#define    TW2EN           2       /* TWI2 Enable */
#define    BM_TW2EN	(uint8_t)(1U<<TW2EN)
#define    TW2WC           3       /* TWI2 Write Collision Flag */
#define    BM_TW2WC	(uint8_t)(1U<<TW2WC)
#define    TW2STO          4       /* TWI2 STOP Condition */
#define    BM_TW2STO	(uint8_t)(1U<<TW2STO)
#define    TW2STA          5       /* TWI2 START Condition */
#define    BM_TW2STA	(uint8_t)(1U<<TW2STA)
#define    TW2EA           6       /* TWI2 Enable Acknowledge */
#define    BM_TW2EA	(uint8_t)(1U<<TW2EA)
#define    TW2INT          7       /* TWI2 Interrupt Flag */
#define    BM_TW2INT	(uint8_t)(1U<<TW2INT)

/* TW2DR - TWI2 Data Register */
#define    TW2D0           0       /* TWI2 Data bit 0 */
#define    BM_TW2D0	(uint8_t)(1U<<TW2D0)
#define    TW2D1           1       /* TWI2 Data bit 1 */
#define    BM_TW2D1	(uint8_t)(1U<<TW2D1)
#define    TW2D2           2       /* TWI2 Data bit 2 */
#define    BM_TW2D2	(uint8_t)(1U<<TW2D2)
#define    TW2D3           3       /* TWI2 Data bit 3 */
#define    BM_TW2D3	(uint8_t)(1U<<TW2D3)
#define    TW2D4           4       /* TWI2 Data bit 4 */
#define    BM_TW2D4	(uint8_t)(1U<<TW2D4)
#define    TW2D5           5       /* TWI2 Data bit 5 */
#define    BM_TW2D5	(uint8_t)(1U<<TW2D5)
#define    TW2D6           6       /* TWI2 Data bit 6 */
#define    BM_TW2D6	(uint8_t)(1U<<TW2D6)
#define    TW2D7           7       /* TWI2 Data bit 7 */
#define    BM_TW2D7	(uint8_t)(1U<<TW2D7)

/* TW2SR - TWI2 Status Register */
#define    TW2PS0          0       /* TWI2 Prescaler bit 0 */
#define    BM_TW2PS0	(uint8_t)(1U<<TW2PS0)
#define    TW2PS1          1       /* TWI2 Prescaler bit 1 */
#define    BM_TW2PS1	(uint8_t)(1U<<TW2PS1)
#define    TW2S0           3       /* TWI2 Status bit 0 */
#define    BM_TW2S0	(uint8_t)(1U<<TW2S0)
#define    TW2S1           4       /* TWI2 Status bit 1 */
#define    BM_TW2S1	(uint8_t)(1U<<TW2S1)
#define    TW2S2           5       /* TWI2 Status bit 2 */
#define    BM_TW2S2	(uint8_t)(1U<<TW2S2)
#define    TW2S3           6       /* TWI2 Status bit 3 */
#define    BM_TW2S3	(uint8_t)(1U<<TW2S3)
#define    TW2S4           7       /* TWI2 Status bit 4 */
#define    BM_TW2S4	(uint8_t)(1U<<TW2S4)


/* ***** TXDSP ************************ */
/* BBTE2 - Base Band Test Enable 2 */
#define    TDEPO           0       /* Tx DSP External Pin Output */
#define    BM_TDEPO	(uint8_t)(1U<<TDEPO)
#define    DITDIS          1       /* Dither Disable on Sigma Delta Modulator */
#define    BM_DITDIS	(uint8_t)(1U<<DITDIS)

/* FFREQ1H - Fractional Frequency 1 Setting, High Byte */
#define    FFREQ1H0        0       /* Fractional Frequency 1 High Byte bit 0 */
#define    BM_FFREQ1H0	(uint8_t)(1U<<FFREQ1H0)
#define    FFREQ1H1        1       /* Fractional Frequency 1 High Byte bit 1 */
#define    BM_FFREQ1H1	(uint8_t)(1U<<FFREQ1H1)

/* FFREQ1L - Fractional Frequency 1 Setting, Low Byte */
#define    FFREQ1L0        0       /* Fractional Frequency 1 Low Byte bit 0 */
#define    BM_FFREQ1L0	(uint8_t)(1U<<FFREQ1L0)
#define    FFREQ1L1        1       /* Fractional Frequency 1 Low Byte bit 1 */
#define    BM_FFREQ1L1	(uint8_t)(1U<<FFREQ1L1)
#define    FFREQ1L2        2       /* Fractional Frequency 1 Low Byte bit 2 */
#define    BM_FFREQ1L2	(uint8_t)(1U<<FFREQ1L2)
#define    FFREQ1L3        3       /* Fractional Frequency 1 Low Byte bit 3 */
#define    BM_FFREQ1L3	(uint8_t)(1U<<FFREQ1L3)
#define    FFREQ1L4        4       /* Fractional Frequency 1 Low Byte bit 4 */
#define    BM_FFREQ1L4	(uint8_t)(1U<<FFREQ1L4)
#define    FFREQ1L5        5       /* Fractional Frequency 1 Low Byte bit 5 */
#define    BM_FFREQ1L5	(uint8_t)(1U<<FFREQ1L5)
#define    FFREQ1L6        6       /* Fractional Frequency 1 Low Byte bit 6 */
#define    BM_FFREQ1L6	(uint8_t)(1U<<FFREQ1L6)
#define    FFREQ1L7        7       /* Fractional Frequency 1 Low Byte bit 7 */
#define    BM_FFREQ1L7	(uint8_t)(1U<<FFREQ1L7)

/* FFREQ1M - Fractional Frequency 1 Setting, Middle Byte */
#define    FFREQ1M0        0       /* Fractional Frequency 1 Middle Byte bit 0 */
#define    BM_FFREQ1M0	(uint8_t)(1U<<FFREQ1M0)
#define    FFREQ1M1        1       /* Fractional Frequency 1 Middle Byte bit 1 */
#define    BM_FFREQ1M1	(uint8_t)(1U<<FFREQ1M1)
#define    FFREQ1M2        2       /* Fractional Frequency 1 Middle Byte bit 2 */
#define    BM_FFREQ1M2	(uint8_t)(1U<<FFREQ1M2)
#define    FFREQ1M3        3       /* Fractional Frequency 1 Middle Byte bit 3 */
#define    BM_FFREQ1M3	(uint8_t)(1U<<FFREQ1M3)
#define    FFREQ1M4        4       /* Fractional Frequency 1 Middle Byte bit 4 */
#define    BM_FFREQ1M4	(uint8_t)(1U<<FFREQ1M4)
#define    FFREQ1M5        5       /* Fractional Frequency 1 Middle Byte bit 5 */
#define    BM_FFREQ1M5	(uint8_t)(1U<<FFREQ1M5)
#define    FFREQ1M6        6       /* Fractional Frequency 1 Middle Byte bit 6 */
#define    BM_FFREQ1M6	(uint8_t)(1U<<FFREQ1M6)
#define    FFREQ1M7        7       /* Fractional Frequency 1 Middle Byte bit 7 */
#define    BM_FFREQ1M7	(uint8_t)(1U<<FFREQ1M7)

